{
	"title": "Prayer Against the Strongman in Door County",
	"header": "Prayer Against the Strongman in Door County",
	"meta_content": "",
	"exclude": false,
	"content": "
<i>You should know what strongman or strongmen rule your area or family. If this is the case, name them in the prayer. Remember, this is a wrestling match and we need to pray these prayers as much as God leads. Principalities and powers will stay in an area. (Unless they are in a person that leaves the area.) So we must consistently break and bind their influence and enforce the victory Jesus has won for us. Praise God! - Pastor Tom</i>
<ol>
<li>Religion</li>
<li>Luke-warmness</li>
<li>Complacency</li>
<li>Alcohol</li>
<li>Suicide (Depression)</li>
<li>Death (Death's Door)</li>
<li>Satanism, the New Age, the Occult</li>
</ol>
Dear Heavenly Father, I come before you in meekness and humility recognizing You are Almighty God. No one can stand before You in power and might. You are most awesome; You are the Head over all principalities and powers.
I recognize that Jesus through His death and His resurrection once and for all spoiled, disarmed, paralyzed, stripped off and completely took away Satan's power and authority. This includes all wicked spirits of all strengths, all principalities and powers, and the rulers of the darkness of this world and all spiritual wickedness in high places, as well as every strongman. Jesus completely rose in victory over death, Hell and the grave. And since I have come to faith in the Lord Jesus I now as a member of the body of Christ have been given a Spirit of wisdom and revelation in the knowledge of Him; the eyes of my understanding are now being enlightened and I know what is the hope of His calling and what are the riches of the glory of His inheritance I have as a saint, a child of God; and what is the exceeding greatness of His power to me, and all the body of Christ, who believe according to the working of His mighty power, which God wrought in Christ Jesus when He raised Him form the dead, and set Him at His own right hand in heavenly places, far above ALL principality and power, and might and dominion and every name that is named, not only in this world, but also in that which is to come. And has put all things under Christ's feet. And gave Him to be the head over all things to the church, which is His body, the fullness of Him that filleth all in all.

I want to praise You and bless You Lord for this understanding. The second I was born-again I became a part of the body of Christ; A part of the Anointed One and His anointing. And I am always watchful and beware, lest any man spoil me though some demonic teaching or philosophy and vain deceit after the tradition of men after the rudiments of the world and not after Christ the anointed one. For in Christ, the Anointed One, dwelleth all the fullness of the God-head body, and now as the body of Christ I am part of that anointing and am complete in Him, who is the head of all principality and power. And I understand that I was buried with Christ in baptism wherein also I have been risen with Him through the faith of the operation of God, who hath (already) raised Him from the dead, and me being dead in my sins and the uncircumcision of my flesh has He quickened, made alive together with Christ, because He has forgiven all my trespasses. He blotted them out, and the handwriting of ordinances that was against me which was contrary to us. And He took it out of the way, nailing it to the cross. And having spoiled, disarmed, paralyzed and stripped principalities and powers Jesus made a show of these demonic spirits in front of all, He made a show, a spectacle of them all, triumphing over them in it.

And now I understand Father, positionally, I have already been risen with Christ. For He has made me alive; I who, was dead in my trespasses and sins. Wherein in times past I walked according to the course of this world, according to the prince of the power of the air, the spirit that now worketh in the children of disobedience. But even when we were dead in our sins, God has now made us alive together with Christ, the Anointed One. And has already (in the mind of God - when Jesus did it He saw me there in Christ) raised me up together and made me sit together in Heavenly places in Christ. So I understand that now all Satanic principality and power which is under Jesus feet is under my feet because I am Christ's, seated with Him in the Heavenly places. I understand that Jesus is the Head, we are His body. This is why Father, Jesus has now given me all authority to cast out and break demonic bondage.

Jesus said whatever I bind on earth is bound in Heaven, and everything I loose on earth is loosed in Heaven. And that I am to behold the fact that Jesus gave me power (authority) to tread on serpents and scorpions and over all the power of the enemy, and nothing shall by any means hurt me. For all devils are subject unto me through His name. And Jesus said these signs shall follow me, a believing one. I shall in His name cast out devils. All Jesus' authority is behind me when I address these principalities and powers. For Jesus said all power is given to me in Heaven and earth. And I am a joint heir in Christ and He works with me, confirming His Word with signs following.

So Father, with this in mind, I come against every strongman that is located in my area, and every strongman that effects me personally. Every principality, power and ruler of the darkness of this world. I break their power and influence over these demonic powers in Jesus' name. I break your influence now. Stop your wiles, your strategies, your maneuvers against us in our area. Now in Jesus' name no weapon formed against us will prosper. In Jesus' name I break your influence over lesser spirits and now we spoil your goods. Because since you are now bound, I also bind and break the power, influence and wiles, strategies and plans of all the demonic powers you control.

Lord God, we ask you to send your angels to root out the enemy. All the things of darkness will now come to light. All those people, including my family, and me, are now free from these evil spirits in Jesus' name. Go from them in Jesus' name. We break your power and we are free.

<i>Now raise your hands and thank God for His mighty delivery of power, flowing to destroy these strongholds and influences. Father I thank You now for all those in this area. Send laborers and Your Word to them. Heal them and deliver them from their destruction. Replace their demonic influence with Holy Ghost influence.	
</i>	"
}
