{
	"title": "Prayer Against the Spirit of Religion",
	"header": "Prayer Against the Spirit of Religion",
	"meta_content": "",
	"exclude": false,
	"content": "
Father God we come to you boldly in the wonderful name of our Lord and Savior Jesus Christ. We just take a few moments to worship and praise You, for You are the mighty King of Kings and the Lord of Lords. We know that You have highly exalted our Lord Jesus and given Him a name, which is above every name, and that at the name of Jesus every knee should bow, of beings in Heaven and beings in Earth and beings under the earth. We thank you that all demonic powers, and Satan himself, have been stripped of their power and reduced to 0 by the death, burial and resurrection of our Lord Jesus Christ. And Jesus has taken away the keys to death, hell and the grave from the devil. And we thank you Father that all authority and power in Heaven and Earth has been given to our Lord Jesus who is the head of His body, the Church. And that since we have been raised with Him to sit in heavenly places with Him, far above all principality, power, might, dominion, all things are now under His feet.

We understand that all things are now under our feet, as the body of Christ. All things are ours. We have already been blessed with all spiritual blessings in heavenly places in Christ. We are joint heirs with the Anointed One. We are sons of God. We are kings and priests, and we shall rule and reign with Christ forever. Because of these great truths Lord, we obey your Word that says, “Whatsoever we bind on Earth shall be bound in Heaven, and whatsoever we shall loose on Earth shall be loosed in Heaven”. And the fact that Jesus said, “Behold, I give unto you authority to tread on serpents and scorpions and over all the power of the enemy and nothing shall by any means harm you”. And Jesus also said, “These signs shall follow the believing ones of which I am one”. In the name of Jesus we should cast out devils.

Lord, we know we don’t wrestle against flesh and blood, but against principalities and powers and rulers of the darkness of this world, against spiritual wickedness in high places. They are the spirits that now work in the children of disobedience. They blind the minds of them who don’t believe, lest the light of the glorious gospel of Christ should shine unto them.

Father, today we are going to deal with the Spirit of Religion. And we know and are not ignorant at this huge demonic device. The strongman of religion has bound millions of people and blinded them to the truth and freedom that there is in Jesus Christ. The Spirit of Religion controls all false religions and doctrines of demons around the world. This includes all false cuts. But it also includes much of the Christian church that has in ignorance bowed down and worshipped religious traditions and man-made and demonic doctrines, more than the true and living God and His uncompromising, unpolluted Word, and ministry and move of the Holy Ghost; The pure Christianity that Jesus Christ desire for all His children. We admit Lord that this Spirit of Religion, this fowl anti-Christ, anti-Anointing spirit has infiltrated or tried to infiltrate every great denomination, group or fellowship, no matter the background. It has influenced or tried to influence the Catholics and the Protestants. And because of this Lord, we admit that still most of the church has taken on a form of godliness but has denied the power there is in true, vital Christianity. This is no ones fault except our own. Every major religion including Islam, Hinduism, Buddhism and all the other ism’s including Satanism are there and thriving only because we as the body of Christ have not done our jobs. We have not prayed as we should. We have not fasted, humbled ourselves and turned from our wicked ways. We have not witnessed, gave money to missions, tithed and given offerings. We have not cat out devils, confessed the Word and exercised our spiritual authority they way we should have. We have allowed carnal thinking, liberal thinking, and demonic thinking into our Bible schools, Seminaries and Bible training centers and churches. We have turned out many milk toast, jelly fish, wimpy preachers who will not in some cases preach the truth because of what people (especially those bound by the demonic forces of religion) might say. We have compromised, many of us, we have made excuses. We have allowed psychology and New Age thoughts to enter into our theology.

And now Lord, I also ask you for forgiveness for all of our leaders. Every Apostle, Prophet, Evangelist, Pastor and Teacher, Elder, Priests, Bishop or any other leader. For all those in charge of Bible schools, Seminaries, Bible training centers, churches, etc… We ask you to forgive all of us for our yielding, if they have, to any religious spirit, any doctrine, idea, vision, dream, prophecy, utterance, etc. that is not from You. We ask for forgiveness. We now break all religious ideas over these leaders in Jesus’ name. We ask Lord You set them free. That those who will yield to You will repent and begin to turn back to the Word of God in its pure form. Free from impure, compromising, liberal and wrong denominational thinking. Purge the church from the to the bottom from religious ideas, tradition of men, and anti-Christ doctrines of demons. We command these demonic influences to leave the body of Christ. We bind you and render you harmless and ineffective in your maneuvers against the body of Christ in Jesus’ name.

Lord, send a mighty move of God into our denominations, churches, Bible schools and Seminaries, etc. Send a hunger for truth like never before. Raise up those who will not compromise, will not accept falsehood. Now Lord, for every person that is bound up by a religious spirit that influences and teaches Your people in Bible schools, Seminaries, Bible training centers, churches, TV radio, media internet, etc. that will not yield to the move of god You send, to all those who are pretenders, charlatans, false apostles, prophets, evangelists, pastors or teachers, priests, elders, bishops or all others in any leadership position. Those who will not repent and accept their freedom, we ask you Lord simply to remove them. And to replace them with someone who will no longer compromise or yield to a Spirit of Religion. Thank You Lord for doing it in Jesus’ name.

We in some cases have allowed perverts and perversion into our churches and a Religious Spirit of Compromise and False Love and False Unity into our pulpits. We have voted for those with a homosexual agenda, a liberal idea that it’s OK to kill and abort children by the thousands. But we must save all the animals. We in some cases voted our pocket books and along denominational lines because of our upbringing, race, or background instead of voting for the men and women You have raised up with Christian principles and moral excellence. It is not policy alone that exalts a nation but righteousness. And sin is a reproach to any people. We in many cases have allowed political parties and views affect what we believe instead of our belief in what God’s Word says to affect our political views.

Lord, we have yielded to this religious anti-Christ spirit too long. We are not going to put up with it any longer. No longer are we going to yield to having a form of godliness but denying the power thereof. We make a stand today against this Spirit of Religion.

Lord, first of all I want to repent for ever allowing a demonic Spirit of Religion and Compromise to influence me. I speak to all religious spirits that may have invaded my life. In Jesus’ name I break your power and command you to go form me now in Jesus’ name.

Lord, if I am bound up or have been influenced in any way by an anti-Christ spirit, doctrine of devils, religious man-made tradition of men, I want it exposed and I want to be free from it. You said everything that is in darkness shall be brought to light. I am free and shall know the truth and the truth shall set me free!! Lord, if I find out my church is operating in religious traditions; I will leave and find one that’s not. Lord, I will do whatever You tell me to do. Send me good teachers, and leaders in Jesus’ name. Lord, I ask You to forgive me for any religious, untrue doctrine or ideas I may have knowingly or unknowingly peddled or sowed into someone’s life. Please forgive me for influencing my family with any of these ideas. I repent.

Now Lord, we present to You all people in all lands that are in any way being bound up and influenced by a religious spirit in any ways. WE intercede for them and ask You to send the perfect laborers into their path with the gospel in Jesus’ name. We come against the Spirits of Blindness and Religion that are influencing them. We break your power, your influence and your ideas over them. Stop your influence now in Jesus’ name. We break the strongman in charge of all religions in all lands, in all areas and in our area and family in Jesus’ name. Your power is broken now. We demonstrate and initiate what Jesus has already done. We free our nations, lands, cities, towns and communities now in Jesus’ name. And now we spoil the Religious Spirits goods. Lord, send these people into Your great God-ordained churches. Send the Word to them and deliver them from their destructions. Lord send Your angles to route the religious spirits out of their lives and the churches lives. Let Your angels influence them into Your perfect will and church. Let the churches who will not compromise with a religious spirit receive the harvest of all those you have set free, now in Jesus’ name. Lord, we pray, send your rain. Send a massive hunger and revival to Your people. Let whole lands and cities and towns once controlled by religious churches and spirits be drenched by the rain and flood of spiritual revival. Let true revelation be preached like never before, and the true church rise to its prominence and glory in the Lord. We thank You for it now, in Jesus’ name.	
	"
}
