{
	"title": "Prayer for Deliverance",
	"header": "Prayer for Deliverance",
	"meta_content": "",
	"exclude": false,
	"content": "
<i>This deliverance prayer is based on scripture and the name of the demonic spirits from scripture. Let God release His wonderful delivering power through you. Pray this prayer at least three times a day. You will be be set free! - Pastor Tom</i>

Father, I want to praise You and worship You and thank You. And I want to acknowledge the fact that You are the Great Deliverer and have already paid for our total and complete deliverance.
And I believe that all Your Word and promises are true to me. So I come close to You and boldly to the throne of grace and power that we need to get free from all demonic powers that are harassing us or influencing us in any way in Jesus’ name.

Lord, I know your Word says that we do not wrestle against flesh and blood, but against principalities and powers and rulers of darkness of this world and spiritual wickedness in high places. But Lord, I acknowledge the fact that Jesus completely destroyed the words of Satan at Calvary. And because of Jesus’ victory over Satan, death, Hell, and the grave, as a member of the body of Christ I have been given by Jesus, all authority over all the power of the devil.

Lord, I believe this and understand whatsoever I bind on earth shall be bound in Heaven and whatsoever I loose on earth shall be loosed in Heaven. So with this in mind Lord, I say I want to be totally free. I want every stronghold against my mind to be pulled down in Jesus’ name. I want my family free in every way. So this is my prayer.

First of all, I want to ask you to please forgive me for any bitterness in my heart against you that may have built up in my heart over the years. Sometimes I may not understand everything that has happened to me in my past or even now. But I know that nothing bad that has happened to me comes from You. For You are good and every good and perfect gift comes from You the Father of lights with Whom there is no variableness nor shadow of turning. So please forgive me for blaming You. Thank You now that I understand that You have come to give me life and to give it to more abundantly. It is Satan and his hosts that have come to steal, kill and destroy. Anything that has stolen from my life is Satan. Anything that has killed in my life is from Satan. Anything that has destroyed anything or anyone in my life comes from Satan. I acknowledge this and do not blame You for these things. Forgive me Lord for believing these religious lies about You. I repent and release You and thank You for releasing me. I also forgive all those who have hurt me in any way. I release them into Your hands and let the hurt they have caused me to be healed and any effects of mistreatment that affected me in my mind and emotions. I ask You to heal my broken heart. Any effects that mistreatment has on my Spirit I ask for healing. And any mistreatment that has caused a physical problem I now receive healing in Jesus’ name. Than You Lord for healing me; spirit, soul and body.

I now also forgive myself for all the hurt I may have caused myself for my unbiblical thinking and actions of the hurt and pain I may have caused others. I take a moment to confess all my mistakes, slips, sins and missteps to You. (Confess what you need.)

I receive Your forgiveness Father and ask You to please heal all the damage that may have been done to me spirit, soul and body by me not forgiving myself. Thank You for healing in Jesus’ name.

I want to thank You Lord that now all the effects of abuse that I have received; spiritual abuse, mental and emotional abuse and physical abuse, verbal abuse as well as sexual abuse or mistreatment is now being healed in Jesus’ name. Thank You for being my Healer in this area.

Now Lord, I acknowledge that the Word of God says that it is possible for the sins of my relatives that may go back for generations to be translated down through to affect me. I realize that these curses come from demonic spirits that may have been released into my family from un-Godly practices, attitudes and actions that my family members have done, going back many generations.

Lord, I am not referring to my flesh that I must control and sometimes wants to do wrong. The sins of the flesh all men have to deal with. I am referring to the demonic, familiar spirits that may have been released into my life from the activities of past family members. I want to once and for all put a stop to any bondage and influence they may have on me or my family members. I ask you also to forgive me for listening to, or cooperating with any of these demonic spirits. Whether I know they were using or influencing me in any way, shape or form or not, please forgive me now in Jesus’ name. Also, I now make a stand to always in the future to resist their influence in Jesus’ name. So, in Jesus name, I command you demonic spirits to leave me; my soul in Jesus’ name. You must go now, you are no longer welcome here in Jesus’ name.

I now bind these devils and all their influence and activities and render them harmless and ineffective against me and my family in Jesus’ name. I also pray for all those who need deliverance themselves in my church family, the overall body of Christ and folks God has His hand on in our area. Devil, I bind you in Jesus’ name. Take your hand off of them all now in the mighty name of Jesus.

Father, thank you for freeing all of us. And I know that your Word is true and you Word says I can have what I say if I believe it. I choose to believe it. What I say comes to pass. So I take authority over all of the princes of the power of the air, cease your maneuvers now in Jesus’ name. All Satan’s princes of this world, I bind your activities up. Stop now in Jesus’ name.

Father, I also separate all around the Word those who are bound and want to be free. Thank You for including them in Jesus’ name. I take authority over all the princes of darkness. And all their activities and command them to stop, cease their maneuvers against us in Jesus’ name. I take authority over every angel of light and all His works. I rebuke you, bind you, break your power, go form me and all I am praying for in Jesus’ name. Stop your work and maneuvers. I pull down your strong hold over all our minds and stop your influence in Jesus’ name. I thank You Lord that your Word says whatever I demand in Your name. You will do it if I demand that all angels of light stop influencing God’s chosen in Jesus’ name.

All Lucifer spirits I now take authority over you. I break your power, influence and authority and works. You must stop your maneuvers now in Jesus’ name.

Every Dragon spirit I break your power over men’s minds. Let them go in Jesus’ name. Lord Jesus set the captives free.

You said the first sign that would follow the believing ones would be that in His name we would cast out devils. So we exercise our authority in this area in Jesus’ name.

Now Father, I exercise my God given authority over all Serpent devils. I break your power, influence and works over all God wants to set free. Right now, go from them in Jesus’ name. I thank God they are free. For whom the Son sets free is free indeed. Thank You Lord for our freedom from all the demonic forces in Jesus’ name.

Now Lord, I separate unto You all that are bound or influenced by a spirit of Beelzebub. I pray Your delivering power on them. I command them to be free from the influence of this wicked, defeated spirit. I command this devil to go. I break your influence over all of us. We are free and delivered in Jesus’ name.

Now Lord, I take authority over all wicked spirits call by the scripture, adversaries. I bind up their influence. Stop now your attacks in the mighty name of Jesus. You must obey me, go from God’s people now. Thank You Lord that this defeated foe is rendered harmless and ineffective against us in Jesus’ name. All adversaries we resist you and you must go from us in Jesus’ name.

Now Lord, we separate unto You all who are bound or being influences by spirits called he Accuser of the Brethren. In Jesus’ name we break your power. Stop your activities now in Jesus’ name. We command you, go from all of us. And thank You Lord fro setting us free. Our minds are not blinded in Jesus’ name. We are free from any pollution caused by condemnation or the Accuser of the Brethren which has been cast down in Jesus’ name.

Now Lord, we come against our enemy the devil and all the devils assigned to make enemies against us. We say devil, we walk in love. You stop your silly maneuvers. We break your power.

And Lord, we take a moment to lift up and pray for our enemies. Lord, bless them, deliver them, enlighten them, save them if they’re not saved, fill them with the Holy Ghost if they are not filled. Correct them if they need it. Send the perfect laborers in their paths in Jesus’ name.

Now Lord, we separate unto You all people that are being influenced by the Tempter or the spirits that cause temptation. Lord, we refuse to yield to demonic temptation. The scripture says sin shall not have dominion over us. So we take authority over all spirits of temptation and render them harmless and ineffective against us in the mighty name of Jesus. Go from us in Jesus’ name.

We take authority over the Wicked One and bind him and render him harmless and ineffective against us. Go from us in Jesus’ name.

The Word calls Satan the thief, so we stop you from stealing now. In Jesus’ name we command you to go.

And Lord, Your Word says if a thief be found or caught he must restore 7-fold what he has stolen. Thief Spirit, we have caught you. Now we declare that all you have stolen will be returned 7-fold in Jesus’ name.

Lord Your Word says that Satan is a murderer. We bind every spirit of murder. Stop your work now. We break your influence. No weapon formed against us will prosper in Jesus’ name.

The Word calls Satan a Roaring Lion. We bind and render all Roaring Lions harmless and ineffective against us. Shut up Roaring Lion, all you do is make noise because Jesus has broken your teeth. Go from us. We resist you and all your works.

And Father God, the Word of God calls Satan a Liar. We know that many people are possessed or oppressed by this lying devil. We bind these devils and command them to come out and go in Jesus’ name. Liars will end up in The Lake. And we are not talking about Lake Michigan. So we resist you and command your influence to go in Jesus’ name.

Satan is an oppressor. He oppresses many ways. But we come against this foul Spirit of Oppression. In Jesus’ name come out, go, flee from us. We break your power and influence now in Jesus’ name.

And last but not least, the Word of God calls the devil the Corruptor of Minds. So we come against all spirits of the Corruptor of men’s minds in Jesus’ name. Go from us. We break all your influence in any way in Jesus’ name. We also bind all Abaddon and Apollyon. Go from us. We free the minds of men in Jesus’ name. We bind and render you harmless and ineffective against us in Jesus’ name.

Thank you Lord for setting all captives free. Thanks for using us and giving us this wonderful authority. Now, we pray for all these have set free. If they don’t’ know you, send laborers in their path. Send your Word and heal them. Bring them into your full salvation and to a great church. Thank you Lord for it in Jesus’ name.

	"
}