{
	"title": "A Lifetime of Stuttering Instantly Healed",
	"header": "A Lifetime of Stuttering Instantly Healed",
	"meta_content": "Your dreams and visions are achievable regardless of the circumstance. God will make a way, even if He has to work a miracle like ending a lifetime of stuttering.",
	"exclude": false,
	"content": "
Ever since I was a child I had a stuttering problem. I probably don't need to describe 
how much horrible teasing and mocking I had to endure growing up. Not only children, 
and teenagers, but also some adults could be very cruel.

I had accepted Jesus when I was a child and always loved Him. However, the church 
that my parents took me to basically taught me that things like my stuttering handicap 
and other deformities and sicknesses were just a cross to bear. And that god had created 
me this was to be an example of how to endure suffering for God. I even as a young child 
dreamed of being able to talk right so I could speak in front of people and be a Christian 
disc jockey. I love music, but really have no talent to play and sing. But I knew that 
this dream could never be fulfilled because of the stuttering.

As I became a young adult, I began to go to other churches to try to find more answers 
than what I had been taught. It began to seem to me that as I read my Bible, some of the 
things my church believed didn't seem right. I finally found myself in a Charismatic 
church that believed in healing and gifts of the Spirit.

One night I was invited to a home meeting where these charismatic Christians would share 
the Word and pray for one another. This particular evening a young man started to lay 
hands on people to be filled with the Spirit and speak with tongues. I was amazed at the 
sight of people speaking in a heavenly language and watching some of them fall on the floor!

I had never seen this before, but somehow what I saw touched my heart and I began to weep. 
I finally got up enough nerve to ask the man praying for the people if I could (with my 
stuttering problem) get filled and speak in tongues.

I found out this man's name (Tom Terry) and he patiently listened to me and said that 
if I simply spoke, God would give me the utterance. I asked Tom to pray, but what I 
received was a strange type of prayer I had never heard. He simply said in Jesus' 
name, Lord loose his tongue and fill him with the Holy Ghost, and Satan, go from him. 
When he did that it was a most unusual experience that followed. It felt for a moment 
that someone hit me in the stomach. I found myself lying on the floor and suddenly 
blanketed in the peace of God, like I have never experienced it. As I lay on the floor, 
I started to cry again. And before I realized what I was doing, I was speaking clearly 
in a language I did not know. And I didn't stutter. As I got up off the floor, I 
suddenly realized that as I started praising God in English I wasn't stuttering anymore. 
Then I started saying other things without stuttering. Not only did God fill me with the 
Holy Spirit and give me His precious prayer language, but He also totally healed my 
stuttering, praise God!

I am now a disc jockey at a Christian radio station and do other speaking for God.

Ben<br>
California
	"
}