{
	"title": "Connie J Burt's Testimony",
	"header": "Connie J Burt's Testimony",
	"meta_content": "Did you know... Unforgiveness can lead to stomache ulcers and pancreatic problems? Fortunately for you, Connie found the cure.",
	"exclude": false,
	"content": "
In the past few years I have been hurt deeply by a local church, by my mother, and by another Pastor. 
The pain was severe and deep and brought with it righteous anger. I gradually withdrew from people and 
public places and my thoughts were so obsessed with these events and the pain, that I gradually had 
less prayer and Word time and more time discussing these things. Six months ago I developed a pancreatic 
cyst and stomach ulcers. I lived through the surgery but the stomach ulcers returned in this last month.

I sought the Lord for two days to find out what my problem was. Besides carrying the pain of those 
other events, I now was confused about God and His Word because I hadn't been healed prior to 
surgery and had ulcers again.

I studied on forgiveness and bitterness, wrath, etc. and knew I wasn't guilty of those. Finally, 
my husband told me to look up resentment. It fit! It described my feelings well. The word resentment 
isn't found in God's Word, I suppose because it's a feeling and not an action. The dictionary 
said resentment is sometimes accompanied with scorn. I didn't know was scorn was so I looked it 
up. Bingo! To scorn is to look down up on as mean or low, feeling a person is unworthy of respect, 
to reject, mock, or scoff, haven an angry dislike of what is (or who is) considered worthless or evil. 
My righteous anger and pain had turned into resentment and then scorn... I told others what people 
had done to me, thinking it would ease my pain, gain me comrades, and cause others to be disrespected 
and rejected. Proverbs 9:8 says a scorner doesn't take reproof. I could see the faults of others, 
but not my own. I stopped growing. Proverbs 14:6 says a scorner seeks wisdom but doesn't find it. 
Proverbs 3:34 says God scorns the scorner. Proverbs 19:29 Judgments are prepared for scorners. 
Proverbs 9:12 If you scorn, you alone shall hear it. Isaiah 29:20 The scorner is consumed.

The pancreatic cyst was full of digestive fluid that would \"consume\", dissolve vital organs. 
An ulcer is stomach acids consuming the stomach lining. Avoiding driving and crowds was being 
\"consumed\" by fear. My goal of causing another rejection and lack of respect and judgment had come on me.

I saw this only last week. I confessed it and have been forgiven and delivered. The stomach 
pain is gone, but best of all.... And I'm excited... is this... God wanted to heal me much sooner but couldn't! His hands were tied. Yes, He is the Healer and His Word is true. All of His Word is true, including the judgments for certain sins. By His stripes I'm healed. Yes! But also a scorner is consumed, yes! Praise God that He was faithful to forgive my sin &#8212; after I saw and confessed it and that He remembers it no more, and now that I am no longer a scorner, I am under His blessing and all I put my hand to is prospering. I am receiving!

I had started to think His Word wasn't true and didn't work, but now know, His Word is so true and works so well &#8212; all of it. Without the whole Word, people are destroyed for lack of knowledge. I can claim healing until the cows come home but if I carry on a sin with it's judgments the current is broken by spiritual law. God's Word works! All of it! He promises consumption for scorners. It works! He promises healing in His name. It works! But when we ask in His name it's more than repeating words. It is living a life in His name.

God Bless,
Connie J. Burt

<b>BONUS TESTIMONY</b>

While doing an income tax I found a mistake on the previous year. To correct it meant no refund and paying in. We prayed and were obedient to God to do the right thing. One day later my husband received a check from work (bonus) for being accident free in the exact amount the refund would have been. The next day we received a refund check in the exact amount ($200) we needed to pay the I.R.S. from a little company for a home sale of over a year ago. They said they had made a mistake. Thank you Jesus!

God's Word is true! The parts we like AND the parts we don't like! We reap what we sow &#8212; good and bad. God's word is our hope.

Before we can resist the devil we have to submit ourselves to God. It all works!!!

Connie J. Burt
	"
}