{
	"title": "Deliverance from Demonic Powers",
	"header": "Deliverance from Demonic Powers",
	"meta_content": "It's dangerous to go to the wrong church as Ivy unfortunately learned while attending a New Age meeting. However, getting into the right church changed things.",
	"exclude": false,
	"content": "
I had received Jesus Christ as my Lord and Savior at a charismatic Catholic prayer meeting. But I didn't understand much about the bible yet. Some of my friends that I thought were Christians told me that they wanted me to attend one of their services. They said that many supernatural things happened and that God did miracles among them. I really felt uncomfortable about going with them for some reason, but they were very pushy and kept asking, saying that I would receive a special blessing if I attended. Finally, against my better judgment, I went with them, thinking what could it hurt anyway.

The second we walked into this service, I knew I should not have come. Something was not right, and a horrible fear 
seemed to meet me at the door. The man speaking was talking about weird stuff, not about Jesus and I wanted to go home. 
But I didn't drive, so I felt I needed to be polite and wait for my friends. Then my friends got up (everyone got up). 
There were only about 10 people, and all joined the man up front who said he wanted to pray a blessing on all the 
attendees. Again, I felt very uncomfortable, but went up anyway. But this was not like prayer we had at my Catholic 
church, this man put hands on me and was asking spirits with weird names to come and be my guides and protect me. 
As he prayed, I seemed to tremble and the fear seemed to increase. I felt very bad, and wanted to go home so bad. 
On the way home Ii asked my friends what kind of church this was that we had went to. He said it really wasn't a 
church, but a fellowship of people who come together to learn about different paths of spiritual enlightenment 
that would lead to God. Some considered themselves Christians, some Buddhists, some Spiritualists, Christian 
Scientists, etc... They said that they were part of the New Age Movement and believed there were many ways to God. And the man speaking was a well known Spiritualist and had power to heal and channel spirits. All this scared me and sounded strange because it was so new to me.

That night I couldn't sleep. A fear like I had never had seemed to overtake me. Over a period of a few weeks I grew more and more depressed and frightened. It seemed like I could hear voices that kept telling me I was going to die or go crazy. At night I would hear sounds like knocking on the walls and moving furniture or stuff in the room. I didn't know if this was real or just a figment of my imagination.

I began to think it was demons from Hell that had come to torment me. I decided to attend a service at a Christian church that a relative went to, where they prayed for people for healing and deliverance. That Sunday I came in late during the worship service. As soon as I found a seat, the pastor stopped the service and asked folks to pray for one another. A young man named Tom Terry came over to me and asked to pray for me. I started to cry and wanted to explain what I was in need of. But he just reached out, touched me, and screamed for the devils to go from me. I felt a power hit me that knocked me down. I felt a release and began to cry and cough. Then I felt the peace of Jesus overwhelm me. I am thankful to the Lord; I have been completely set free. All the fear, torment and noises stopped. I have learned that I had gone to a meeting that was full of wrong spirits and they began to torment me. But Jesus set me free. I thank the Lord for sending this young man to help me when I didn't know how to help myself.

Ivy<br>
Salinas, CA
	"
}