{
	"title": "I used to walk closely with God",
	"header": "I used to walk closely with God",
	"meta_content": "Fortune reader via rock and bone rivenes who became depressed and suicidal burns their witchcraft things and the power of God delivers and restores shortly after...",
	"exclude": false,
	"content": "
I used to walk closely with God after I was a child and in my early teens. But over a period 
of time I slipped away from the Lord into a world of alcohol, drugs and sex. Over the years 
my heart grew harder to God and I started being interested in the occult and especially forms 
of old witchcraft. I learned to read fortunes through the use of rock and bone rivenes.

But I thank God that He never gave up on me. One day when I was at the end of my rope, 
depressed and suicidal, I saw Pastor Tom Terry on TV. I watched the entire program and 
thought, \"This man seems to know God real good. Maybe he could help me.\" Later that 
week I called his church and made an appointment to meet with Pastor Tom. I explained 
my life and that I was involved in witchcraft, but wanted to get back to my faith I 
had in my childhood. Pastor Tom told me to bring all my witchcraft stuff with me to 
the appointment. I came to the appointment not knowing what to expect. Over the last 
few years I had developed a strange paralysis in my left arm. My hand had curled up 
and I couldn't move it. The doctors could not understand what was wrong with my arm. 
(There was no medical reason.) Pastor Tom was different from anyone I ever met. He 
didn't talk much but listened to me. He asked if I was sincere and wanted help. I said 
I did. He told me to throw all of my witchcraft items in the trash, so I did.

He then told me to pray with him a re-dedication to Jesus and I did. Then something 
I wasn't expecting happened. Pastor Tom screamed at the demons that had hold of me 
to leave and asked God to heal my hand. He then reached out, took my hand and it 
received strength and straightened out. I was healed and God restored my peace. And 
now I have a wonderful Christian life. Jesus has restored everything, I love him so. 
	"
}