{
	"title": "I've been wanting to share a testimony",
	"header": "I've been wanting to share a testimony",
	"meta_content": "Diligence and Prayer for an uncompromising preacher and church in her area, the testimony of Jennifer!",
	"exclude": false,
	"content": "
I've been wanting to share a testimony as Pastor Tom has asked of us. I thought this 
would be the easiest way to do that. I would like to say that Faith Alive Fellowship 
has been an answer to prayer for me. I desired and prayed to have a full gospel church 
that preached the uncompromising word, and that is exactly what Faith Alive Fellowship 
is. I have never experienced being so well taught. It has given me the foundations to 
turn around and teach and mentor others. I can hardly count the many opportunities I've 
had to share with others what Pastor had just shared in church. And of course taking 
notes helps me even share all the more accurately!! I have experienced many healings. I 
can remember having a pain in my shoulder for many many months. Pastor prayed for me 
and I never experienced the pain again. I was instantly healed. Another time I had a 
cold that was giving me lots of pain and congestion. As Pastor Tom was preaching the 
word I knew just by hearing the word that I was healed. I was standing in the prayer 
line, but I knew I had already been healed. I told him when he came to me to pray that 
I was already healed. He still laid hands on me, and I fell under the power of the Holy 
Ghost. When I stood up the congestion was totally gone, as well as my headache.

These individual instances are wonderful, but the best thing is to be able to walk in divine 
healing. There have been times when I've begun to get sick, but because of the equipping of 
the saints that Pastors Tom and Stella have ministered, I did not succumb to the sickness. I 
speak the word over myself, and always come out victorious. I don't remember being sick since 
Pastors have been here. I have also been blessed to be able to see my daughter Tina come to 
know the Lord as her personal savior and filled with the Holy Ghost under Pastor Tom's 
ministry. That's as rewarding and even to some extent more rewarding than realizing my own 
salvation. I stand confident in knowing that my whole family will come to know the Lord in 
this same personal and intimate way. God's promises are true and sure. I don't go by what I 
see but by what the word tells me!

It has been my privilege to truly love this body of believers with the love of the Lord. 
They are my family, and it sometimes overwhelms me to be a part of this church. It is not 
ordinary, or usual. It is built on the sure foundation of Jesus, and it's power to reach 
others is as limitless as the Lord himself is. I've also appreciated so much the freedom 
in worship that is at FAF. The joy of the Lord is always present in the services, and so 
refreshing. The prayer of the worship team is always to let the Holy Spirit be in control, 
and for us to have a sensitive to follow that leading. Pastor Tom has been a great help 
to me in leading worship and I always aim to lead the congregation into that place where 
Pastor can truly minister to them in the power of the Holy Ghost. It is wonderful to always 
be excited to come to church to see what the Lord has in store next. The gifts of the Holy 
Spirit are manifested in our services and I never cease to be grateful to have a church that 
embraces all that the Lord wants for His body. FAF truly does what its mission says. It is 
the TEMPLE, which teaches, evangelizes, mentors, prays, loves and establishes. God is so good!!!

Please share this testimony anyway that you would like. I know there is so much more to 
come, and I look forward to touching our community through FAF.

Love in the Lord,
Jennifer 
	"
}