{
	"title": "Koors' Testimony",
	"header": "Koors' Testimony",
	"meta_content": "Genuine love leads to the local party folks being set free from the addiction to alcohol and all the health issues that came with the lifestyle!",
	"exclude": false,
	"content": "
My husband and I have been going to Faith Alive Fellowship for almost two months now. 
We heard about the church from an acquaintance, who is now a friend and attends FAF. 
The Lord has radically changed our lives! I myself had been saved in the eighties, but 
hadn't been walking with the Lord. My husband had been led through the salvation prayer 
by a pastor a short time before attending FAF, but didn't understand what it all meant 
because it had really never been explained to him.

When we attended the church for the first time, we were a little skeptical. One thing 
we did notice though, everyone was so inviting and genuinely loving. We felt paid a
ttention to; the congregation and pastors were interested in us. My husband wasn't sure 
about it all at first, but then when our granddaughter came out of children's church at 
the end of the service, she was so excited and asked if we could come back next week. 
That got our attention.

Since attending FAF, we've both received the baptism of the Holy Spirit with the evidence 
of praying in tongues. Our hunger for God cannot be satisfied! We've bought books, tapes, 
and dvds to teach us about different subjects... we want to be surrounded by the Word! We 
both used to be heavy drinkers, but God has delivered us from any desire to do so because 
He's filled all the voids. My husband had tried to stop for three years!

Our marriage, which was almost ruined because of the drinking and consequences of drinking, 
is now being restored. With the help of the Holy Spirit, we are learning to respect each 
other and put balance into our lives. Our relationship with our granddaughter (who lives with us) 
is healthier. We pray together as a family, and not just at mealtime. I've even gone to 
forgive someone who had hurt our marriage.

I've been delivered from all my prescription medications for asthma and sinus problems 
and my stomach problems, praise the Lord! Our businesses are both prospering ever since 
we've decided to tithe to the church.

All in all, the teaching we've received in this short time and the fellowship we have with 
our brothers and sisters at FAF has changed our lives! We praise God for all He's done!

Norm & Lanette Koors<br>
Sturgeon Bay, WI
	"
}