{
	"title": "My Greatest Testimony is My Salvation",
	"header": "My Greatest Testimony is My Salvation",
	"meta_content": "The testimony of a devout Jehovah Witness who asked God for more when they started to feel empty, like something was missing",
	"exclude": false,
	"content": "
First of all, my greatest testimony is my salvation. I had grown up all my life as a Jehovah's Witness. 
I was faithful to attend that church, but it always seemed empty and missing something. I began to think 
there was something more, so I thought I might need to try another kind of church. I prayed and asked 
God to help me find a church where I could learn about Him if this Jehovah's Witness church was not His best for me.

So I opened up the phone book and after one look in the church section, I knew I would need help. There 
were so many different churches listed. So I prayed for help again. As I did, I turned the page and an 
ad for one church seemed to pop out at me. It was a church called Whole Word Christian Fellowship. I 
picked up the phone and called the number and happened to get the pastor. He was so nice and invited me 
to the next service, a bible study that Wednesday. I decided to go. I began to realize that even though 
I had attended church all my life, I didn't know anything about God. In fact, I didn't know God at all. 
After the service I prayed with the pastor and received the real Jesus as Lord and Savior. My life was 
changed as a great peace came on me for the first time in my life.

Then at church several weeks later I was filled with the Baptism of the Spirit and spoke in tongues. 
I praise God for this. I also received a wonderful healing. I had an accident 20 years before that had 
injured my back horribly. I was always in pain and thought my work like was over and that I was going 
to have to depend on disability. But Pastor Tom prayed for me at church and Jesus totally healed my 
back. I didn't need medication for pain any longer and haven't been back to the doctor once since the 
healing. I got a job as a realtor and have began to work. I have been supernaturally blessed financially. 
He also gave me a perfect husband. I give Jesus all the glory. And thank God for Whole Word and Pastor Tom.

M.<br>
Reno, NV
	"
}