{
	"title": "Norma Stern's Testimony",
	"header": "Norma Stern's Testimony",
	"meta_content": "Have you ever seen those crazy preachers praying for people, saying 'God is healing you and will continue to heal you at home' after they don't get instantly healed?",
	"exclude": false,
	"content": "
I had a slipped disk in my back and was really in pain. I came up for prayer from 
Pastor Tom and he prayed. He asked me if I still had pain and I did. There seemed to 
be no change. Pastor tom told me to come back to the meeting the next night and give 
my testimony then because by then I would be healed. I walked away kind of disillusioned 
because I wasn’t instantly healed. I was thinking, \"Who does this guy think he is saying 
to come back tomorrow?\" and all that. So that night I went to bed and I finally fell asleep. 
I woke up late at night and was still in pain. But was able to go back to sleep. The next 
morning I awoke and noticed the pain was gone and I was totally healed. Praise the Lord Jesus Christ!

I had been depressed for many years. The doctors told me I had a tumor on the brain. 
This caused e to have epileptic fits. I had to take medicine for severe pain as 
this caused my eye to wander and I had terrible migraine headaches. I was suicidal 
and my marriage began to fall apart as my husband was a Mormon. I had been to have 
prayer at other churches, but when I went nothing happened, so I would go away 
disappointed. One time I went for prayer and had a seizure and all they did was call 
an ambulance for me. A friend at work had tried to get me many times for months to go 
to his church, Whole Word Christian Fellowship. On Halloween night, 1990, I decided to go. 
We went to a bible study at his apartment. I went up and asked Pastor Tom to please pray 
for me as I was about at the end of my rope. When he did I fell on the ground under the 
power. As I was laying there I had a seizure. But Pastor Tom prayed different than anyone 
I ever heard. He commanded the spirit to come out in the name of Jesus and for the tumor 
to dissolve and die. I felt this evil presence that I know now was several evil spirits 
leave me. Praise God, I am totally healed! No more seizures! No more pain, no more tumor, 
no more addiction to medically prescribed drugs. And as an added bonus my Mormon husband 
came to hear Pastor Tom and several weeks later was saved and filled with the Holy Ghost, 
and Jesus has healed our marriage. Praise the Lord!

Norma Stern
	"
}