{
	"title": "Stephanie Soucek's Testimony",
	"header": "Stephanie Soucek's Testimony",
	"meta_content": "There was something different about her sister that Stephanie had not seen in her growing up at home... Her life would never be the same again",
	"exclude": false,
	"content": "
The Lord has become such an important part of my life in the past couple of years. I now have a 
positive outlook on life and am able to overcome difficult situations by trusting completely in 
God, my father. Even though I still have much more to learn, I have come a long way.

The Lord led me to Faith Alive Fellowship through my sister who was already part of the church. 
I noticed there was something different about her, and I wanted to know why she had changed. I 
was going to a church that I enjoyed for the most part, but did not realize what a wonderful 
life God had to offer me. I felt just as messed up as the rest of the world. Not knowing who I 
was in Christ, I had been plagued with a low self-esteem and insecurities my whole life. I often 
would compare myself with others and felt inadequate. I was what you would call a \"people pleaser.\" 
Depression would come and go and I often felt alone in the world. Even though I loved the Lord 
most of my life, I didn't allow Him to love me the way He wanted to. I depended on imperfect 
human love instead of the perfect love of God. Only God could meet my deepest need for love.

When I first heard Pastor Tom preach, I hungered for more. He taught the word of God like I had 
never heard it before. He made me want to know God better than I did. I had been going to church 
most of my life, but I had never felt completely free of the cares and the burdens of this world. 
I struggled going back and forth, being tossed about by every wave of adversity. Fear had run 
my life and I didn't even know it. The more I heard Pastor Tom preach, the more I began to realize 
who I was in Christ. I began to understand the love God had for me and how the Lord wanted me 
to be victorious in this life, not just in the life to come (in heaven). I started learning that 
every part of our lives is important to God. Over time, God became my loving father, not just 
a God who was far away and intangible.

Pastor Tom also showed me that Christians should be over-comers of every trial and test. Trials 
and tests are not meant to defeat us; they must come so that we mature in our faith. James 1:2-4 says, 
\"Consider it pure joy, my brothers, whenever you face trials of many kinds, because you know 
that the testing of your faith develops perseverance. Perseverance must finish its work so that 
you may be mature and complete, not lacking anything.\" James 1:12 also says, \"Blessed is the man 
who perseveres under trial, because when he has stood the test, he will receive the crown of life 
that God has promised to those who love him.\" So even though we experience trials and tests in 
this life, we can and should be victorious in every situation. Getting through the problems that 
come our way builds character, and God is more than able help us through anything and everything. 
The Lord will never leave us or forsake us.

We, as Christians, have a responsibility to read the word and apply it to our lives. God is not 
always going to do whatever He wants and he will never override our wills. It is also not up to 
us to do everything on our own. We must work with God by doing our part through trusting him and 
allowing him to guide us along the way.

Faith has now replaced fear. Even though I am not perfect, I strive to read the Word of God, 
believe it, and live it, regardless of my circumstances. I am learning to walk by faith, not 
by sight or by feelings. When fear and insecurity try to come back into my life, instead of 
giving into them, I choose to believe what God says about me. I learn to overcome them by standing 
on the Word of God. I now know who I am in Christ, and I continue to allow God to stretch me and 
change me as I seek Him.

Stephanie Soucek<br>
Sturgeon Bay, WI
	"
}