{
	"title": "Dee Dee Eldridge Prophecies",
	"header": "Dee Dee Eldridge Prophecies",
	"fname": "dee-dee-eldridge-prophecy.html",
	"meta_content": "Dee Dee Eldridge Prophecies to Pastor Tom and Stella -- covet to prophesy",
	"exclude": false,
	"content": "
You are of no reputation, you don't care what people think and that's why God will exalt you because all you care about is the Lord being glorified. They can say what they watlt, they can persecute you, they can call you the names, but you are of no reputation because all you care about is Him being glorified, hallelujah. And He said He will exalt the humble and the humble are those who don't care about anything except the fact that He is glorified. And that's why He is going to exalt you, praise God.

I see Stella freeing up Tom in greater ways. I see you freeing up his time, I see you protecting him, I see you like a shield. Stella, the Lord has given you the gift of faith real strong in your life and even though he's going to be on the front lines a lot, I see you on the front lines too. I see you as a shield of faith. There is going to be darts that will never reach your husband because you have the shield, the gift of faith. Your going to protect him from words, you're going to be a real covering, a shield of faith. Two are better than one for they have a good return for their work and I really sense that his promotion is coming through your efforts. That sounds kind of funny, but two have a good return for their work.

I see you doing more writing. I don't know if you're called to be a teacher or whatever, but I see you doing more writing. I see you even heading up a newsletter writing, an article or something like that. You have a tender spirit, and being able to communicate that, I see you writing.

I see Tom as the puppet, I see you as the hand underneath him pointing out the crowd. You are the one who lifts him up or pulls him down. I see God's put a lot of power in your hands and your ability. Where it seems like you're weaker in some areas, the outward areas, your strengths are now going to become his strengths. Where he is weak, you're going to become his strength, you're going to be like a foundation underneath him. I really see that without you there holding him up, he would fall over, but your going to be the fourth leg on the table that has four legs, without that fourth leg he would fall over. But your going to be like that fourth leg steadying the faith. Your going to be the faith woman, just jump in the phone booth, faith woman, amen. Big F on her chest, your going to have faith to believe for great things. Faith to believe for finances, to believe in supernatural finances.

As a tree is planted, you must sometimes tie a stick to it to hold it up. I see you as that stick. That strong pole or stick that's holding him up as he gets his roots down and his branches branch out. That strong stick he's tied onto and he needs it until those roots go down and grow deep so he can stand tall and the branches branch out. And as the branches grow out and the roots grow deep, the stick doesn't get pulled away, it stays there as sort of a security, kind of thing for a long, long time. In the beginning, that's what you are, a stick, a foundation.

And as I was praying in the spirit, I saw your lips are going to be -the words that come forth from your lips are going to be like fine, like a sharp two-edged sword, a greater prophetic anointing. Though people will look at you and think there is this timid person and they can get things over on you. As you open your mouth, the utterances of God, they will be set back and they will recognize that there is an anointing they will recognize that the power of God is moving through those lips. Covet to prophesy, covet to prophesy. Edification, exhortation, comfort, covet to prophesy. Amen. 
	"
}