{
	"title": "Don Eldridge Prophecies",
	"header": "Don Eldridge Prophecies",
	"fname": "don-eldridge-prophecy.html",
	"meta_content": "Don Eldridge prophecies to Pastor Tom -- pioneering and trailblazing",
	"exclude": false,
	"content": "
I really sense, brother Tom, I really sense that a -I know your life and I know some things in the natural, See, a lot of times I will prophesy over people I know, I know things in the natural, the things I don't know, or whatever, then the Holy Spirit will confirm it, whatever. I really see you as one of the young disciples. The religious leaders brought them in and said stop using that name, stop using that name, stop speaking that name.

Don't put any of that blood on us, they said. They refused, they said. Acts 5 :20, 'Go, stand and speak in the temple to the people all the words of this life, ' We could only speak the things that we have seen and heard, the things that we have seen and heard, the things that we have seen and heard.

Acts 8, it talks about Philip the Evangelist saying they heard his word but then they saw the miracles that he performed and then it said they paid close attention to what he had to say. And what I really see for you and I see for your ministry, is I see a respect coming. And it says they looked at the disciples, they marveled because they were schooled but they were unschooled. They weren't in the official school. They weren't part of the Rabbi outfit, you know, they didn't have the robes hanging from them and all that stuff. But they marveled because of the boldness at which they spoke, amen, and I really sense and I know this from hearing you speak this morning and everything, but I just sense that there's a strong anointing of boldness and authority.

The authority I see is tied up into the word exussia. Exussia, that means exercising the right of authority. It means a lot of other things. Exercising the right of authority and I really sense. They marveled at Jesus because he didn't speak as the Scribes and the Pharisees, but he spoke as one having exussia, having authority and they said of Jesus, did not words burn within us? Wasn't there a burning? Wasn't there all authority? The words that he spoke, they burned within our hearts, praise God.

And I really sense that God is going to cause you, praise God, I see you as a pioneer, you're going to be blazing new trails, amen. 
You are going to go where no other preacher has gone before, praise God. To say things that no other preacher has dared to say, hallelujah, 
We are of no reputation and this is what and you have to judge this and till\"'- will prove this out. 
I don't fling this out lightly, 1 don't think I've ever said this over anybody else before, okay. I know his humbleness, I know his heart, 
okay, I know he's not a politician, I know what's in his heart so I can say this with confidence. I really sense that God is going to 
raise you up as a national ministry, amen. I just see you as like from a central location, like a satellite. I see you being beamed to different areas, your ministry,
your influence. I really see you as a, 1 see your teaching tapes, I see books that are going to be advertised nationally. I really sense that God's going to use you in a national ministry, praise God, amen. And I don't know if I have shared these scriptures, but these are scriptures you need to stand on as a church and for your prayer list for this church and this ministry, amen: I Corinthians 3: 6, 'I have planted; Apollos watered; but God gave the increase. I Psalm 18: 19, 'He brought me forth also into a large place; he delivered me, because he delighted in me. ' Psalm 18:36, 'Thou hast enlarged my steps under me that my feet did not slip. ' Psalm 31: 8, 'And hast not shut me up into the hand of the enemy: thou hast set my feet in a large room. ' Psalm 118:5, 'I called upon the Lord in distress: the Lord answered me, and set me in a large place, I Isaiah 54:2-3, 'Enlarge the place of thy tent, and let them stretch forth the curtains of thine habitations: spare not, lengthen thy cords, and strengthen thy stakes; For thou shalt break forth on the right hand and on the left; and thy seed shall inherit the Gentiles, and make the desolate cities to be inhabited. ' I really see nations, national and even nations world wide. You will make desolate cities inhabited, praise God.

Acts 2:47, 'Praising God; and having favour with all the people. And the Lord added to the church daily such as should be saved. Acts 5: 14, 'And believer's were the more added to the Lord, multitudes both of men and women, ' Acts 6:7, 'And the word of God increased; and the number of the disciples multiplied in Jerusalem greatly; and a great company of the priests were obedient to the faith, I Acts 9:31, 'Then had the churches rest throughout all Judaea and Galilee and Samaria, and were edified; and walking in the fear of the Lord; and in the comfort of the Holy Ghost, were multiplied' Acts 16:5, ~and so were the churches established in the faith, and increased in number daily, I One of the key words for this church is multiplication, amen. Psalm 147:6, 'The Lord lifteth up the meek: he casteth the wicked down to the ground. I Psalm 148:14, 'He also exalteth the horn of his people, the praise of all his saints; even of the children of Israel, a people near unto him. Praise ye the Lord. I

The horn stands for the anointing, the horn stands for its life there is coming all exalting of the anointing. 1 know I can share this, this is big heavy stuff and I can share it because he is humble. Proverbs 4:6-8, 'Forsake her not, and she shall preserve thee: love her, and she shall keep thee. Wisdom is the principal thing; therefore get wisdom: and with all thy getting get understanding. Exalt her, and she shall promote thee: she shall bring thee to honour, when thou dost embrace her.

I really sense there is going to come an exalting of the word and the word's going to exalt you, amen. I Samue13:19-2l, and Samuel grew, and the Lord was with him, and did let none of his words fall to the ground. And all Israel from Dan even to Beersheba knew that Samuel was established to be a prophet of the Lord. And the Lord appeared again in Shiloh: for the Lord revealed himself to Samuel in Shiloh by the word of the Lord' Psalm 75:6- 7, 'For promotion cometh neither from the east, nor from the west, nor from the south. But God is the judge: he putteth down one, and setteth up another.

I really don't sense that anyone organization or individual or anything like that is really going to be the key. I really don't see you riding on other people's coat tails. 
I don't see you riding in other people's sky trails. I really sense that God's putting a pioneering. Other people have been starters in your ministry, but I don't see you 
as following in someone else's sky trails. I see you on the cutting edge. I see you as Elijah on the front end of things. ] see you in new avenues, new parts of life and not 
to bring disrespect to anyone that mentored you or anything like that, but I really sense you have a pioneering spirit. You're going to be breaking forth with a new thing. Amen. 
	"
}