{
	"title": "Dick Mills Prophecies",
	"header": "Dick Mills Prophecies",
	"fname": "dick-mills-prophecy.html",
	"meta_content": "Dick Mills Prophecies to Pastor Thomas C Terry, the promise will be fulfilled to the prisoner of hope. Don't give up, the vision is for an appointed time.",
	"exclude": false,
	"content": "
Habakkuk 2:3, 'For the vision is yet for an appointed time, but at the end it shall speak, and not lie: though it tarry, wait for it; because it will surely come, it will not tarry. ' The vision that has kept you going for twelve years is for an appointed time. Though it seemingly linger and tarry, don't give up on it because it's going to come to pass. It's going to be fulfilled. Luke 1 :45, -and blessed is she that believed: for there shall be a performance of those things which were told her .from the Lord. ' There shall be a performance of those things that were promised you by the Lord. Numbers 23:19, 'God is not a man, that he should lie; neither the son of man, that he should repent: hath he said; and shall he not do it? or hath he spoken, and shall he not make it good?' He said it, He'll do it. He's spoken it and He's going to make it good.

I love Psalm 9, 'By the word of the Lord were the heavens made and all the host of them by the breath of his mouth. He gathereth the waters of the sea together as an help: he layeth up the depth in storehouses. Let all the earth fear the Lord: let all the inhabitants of the world stand in awe of him. For he spake, and it was done; he commanded; and it stood fast. ' Ezekiel 12:28, 'Therefore say unto them, Thus saith the Lord God; There shall none of my words be prolonged any more, but the word which I have spoken shall be done, saith the Lord god' None of my promises shall be delayed any more. That promise I have given to you shall be brought to pass.

He's got a ripple effect promise. Acts 1 :8, 'But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem and in all Judaea, and in Samaria, and unto the uttermost parts of the earth. ' Jerusalem, Judaea, Samaria, the uttermost parts of the earth. And He knows, they both know, that they're in this world for special functions, extraordinary functions, unusual functions, and it's got the ripple effect. It's going to start with them, then it's going to impact their community, the area, North America, the uttermost parts of the earth.

Zechariah 9:12, 'Return you to the strong hold, ye prisoners of hope: even to day do I declare that I will render double unto thee. ' Don't give up on your dreams. God help you to keep your dreams alive, your hope alive, your vision alive, your desires alive. Don't let disappointments, people's inconsistencies, human depravity, the people who have a striving spirit, don't be affected by the inconsistencies of the human level. Job 23: 10, 'But he knoweth the way that I take: when he hath tried me, I shall come forth as gold. ' He's put you through a process of training, grooming, conditioning, preparation. He knows the way that I take when He's tried and I'm going to come forth as pure gold. And the Lord gave me a vision of a driveway two miles long and an airplane going down that whole runway with it's wheels on the ground and all of a sudden a lift off that when the promises start coming to pass, it's like the lift-off time. And you folks are ready for lift off. You're ready for soaring. You're ready to get off the ground.

The vision is for an appointed time, though it tarry, just wait for it. He knows the way that you'll take when He's tried you, will come forth like pure gold. Isaiah 25:9, ~and it shall be said in that day, Lo, this is our God; we have waited for him, and he will save us: this is the Lord; we have waited for him, we will be glad and rejoice in his salvation. ' You're going to say real soon, real, real soon, sooner than you think, you're going to say, this is it! We've waited, and waited, and waited. It's been a long time coming, the night has been long, the loneliness has been tremendous, this is it. We've waited and the Lord has manifested His power. I've got good news, you're not going to have to wait long. Your ship is coming in. 
	"
}