{
	"title": "Chuck Flynn Prophecies",
	"header": "Chuck Flynn Prophecies",
	"fname": "chuck-flynn-prophecies.html",
	"meta_content": "Chuck Flynn Prophecies -- Strength and Vision",
	"exclude": false,
	"content": "
No legal harassment will come nigh your dwelling and because my strength is upon you, the anointing of my power shall go before you. Soared, yea, with the eagles and my strength shall be upon you. Therefore, yea, left up your eyes, for in this year of change you will see the Lord. I'm going to bless you mightily and my strength shall flow through you. My daughter, the vision that I gave you, it was about a year and a half ago, but yea I've restored it and even this month you're going to see the anointing go before you. Your going to see many women be loosed in my power. Many will come to me because I've given you a finesse of leadership and glory, now, yea, loose the anointing, loose the peace and the glory of my name for I will bless you mightily, you'll compliment thy husband and my strength shall be upon you. My son, I put you there because, yea, I I've taught you my ways and the glory of the Lord shall guide you and I will lead you with a banner of my peace and you will set many free. For I've given you a liaison ministry. There will be such an impact of glory, therefore, there will be no types of I've showed Israel my acts, but I've showed Moses my ways. The acts of God will not keep my people now from the ways that I am revealing. I'm revealing them through you and I'm going to lift them, lift them up through that barrier, generational berries that stopped every revival. Now I'm going to break it and loose it and you will be part of that anointing that shall soar through that berries and my anointing shall bring it to pass. And will be glad now, what the Spirit just told brother Tom and his wife. Let's not be hoodwinked, God wants signs to follow, but He also wants us to come into the Father heart. And every move of God has been stymied by healing type ministries. It's fine, but when you build upon that foundation that I showed Israel my acts, but I showed Moses my ways. Now, let's stick with the ways of God. Every time we have a miraculous ministry there's hardly any Word preached, you couldn't get the crowd to come if some of you were preaching like you have today. Bless God, I think it's wonderful. And we should have had eight to ten thousand, but there will be a day when the Word shall be honored and that's what was prophesied and I for one say Lord I receive that to me. Amen.
	"
}