{
	"title": "Joan Pierce Prophecies",
	"header": "Joan Pierce Prophecies",
	"fname": "joan-pierce-prophesy.html",
	"meta_content": "Joan Pierce Prophecies, the birthing of God's army",
	"exclude": false,
	"content": "
Because you have been faithful, faithful, faithful to go and do, to go and do all I have commanded you to do, I will open doors, doors, doors for you to walk through. And there will be an army of work for you to do for I am calling you to raise up an army for me in this last hour and many ministries will be berthed and they will be berthed and they will go to and fro throughout the land and around the world and there will be multitudes and multitudes and multitudes that will be brought into the kingdom. And you will not see for so many will be far and they will be here and there and there will be ministries berthed allover the land. Yes, you are called to be as my Apostle to go forth to birth, to birth, to birth, to birth, to birth, to birth, to birth things. In people, yes, you will direct them and help them. I have berthed it in them, but you will unfold them and help them to move in what I have called them to do, yes, I have called you to be like generals in my army as tools in my hands because you do not seek glory of man, you only seek one heart cry and that is my heart. You seek me and because you have been faithful to only seek me, you have not looked for fame, you have not looked for glory, you have not looked for recognition, you have not looked for the big numbers and the big crowds, you have looked for the individuals and said, 'what do! see, what is their gifting, where is their calling' because you have been faithful to step aside and let others be exalted, because I have seen in your heart a heart that is true, a heart that is faithful, yes you shall see a multitude, multitude, multitude and yes, your buildings will be full, your vats shall overflow and there will be, will be so many brought into the kingdom that you will say, 'what shall I do?' and yes my children, I will bring you tools and I will bring you ministers and I will bring you the ones that are anointed, I will bring them right here and they will be part of your body to help build a great end times mighty army that is going to sweep the world for my revival is here. Do not wait for my revival, for it is here. The spirit of revival is in the land. You do not need to go to foreign fields for the revival is here in the land, it is in this place, it is for this day, it is harvest time, so go forth into my harvest fields in Jesus' name.

In Jesus' name, let that heart of God, your heart be so strong inside of them, oh, hallelujah, birth it in them, birth it in them. Father, father I ask for restoration. Father, his heart cry is Lord I want to be so sensitive of souls. This is his heart cry, I want to be so sensitive of souls, that is my heart, that is my heart. Father, place that heart -that they will never see the world the same ever again, never again. He will look out and he will see the gifts and callings in people. He will look out and he will now, he will know supernaturally, exactly where they fit in your divine plan. He will look into even not just this congregation, but in other congregations where he goes and he will know where the gifts and the callings are supernaturally, by your Spirit, Lord. And we thank you word of knowledge will flow, word of knowledge will flow and be strong and mighty, yes, for as he will direct, as you direct, Almighty God, and you show him your divine plan, he will help and encourage and lift and lift those that have fallen by the wayside, oh God. God, there are so many. Those, those that have been beaten by the attacks of Satan, that have not known who they are in Christ, that have fallen, they shall be restored in this day, they shall be restored in this day, they shall be restored in this day, they shall be restored. Restoration, this church is a restoration home. Restoration to the lost, to the hurt and to the ministers that have fallen by the wayside. They shall be restored in Jesus' name.	
	"
}