{
	"title": "Ordination Meeting Prophecies",
	"header": "Ordination Meeting Prophecies",
	"fname": "ordination-meeting-prophecies.html",
	"meta_content": "Prophecies spoken at Pastor Tom Terry's Ordination",
	"exclude": false,
	"content": "
<h3>Clifford Rice</h3>
The Lord would admonish you to enter into that ministry he has called you to and not to stand back any longer, but to stand tall that God is your source. And Tom, move as God directs you for the Lord surely has harnessed you together as two, two to do a work unto His Name.

<h3>Randy Heckley</h3>
The Lord is telling me that He wants you to move out more in the Word and ministry of the Word and that even though you might not say anything different than Tom, it's the same as the mother to her children. See, and dad can come in and say things and the kids have a hard time receiving it, but mom can come in with the love and the sweetness and the gentleness and her ability to present it makes it in a way they can receive it. There's a balance here that's a little bit missing because you're not doing that. And the Lord wants you to start moving in that area and there's a need for it. See, there are things that Tom, and Stella, He didn't just call Tom, but Stella too and there's a team that brings balance in the way you're going to bring that forth. And the people need that. This is just the beginning of your fruit. This is just the first crop, the small one. The branches shall run over the wall.

<h3>Clifford Rice</h3>
Thus says the Lord, I have call you and ordained you and have established you. I have given you a solid foundation in my Word and I have given you this place from which to launch the attack upon all the powers of the enemy throughout this land. And all those areas that are placed within your heart, understand that I have placed them there, says the Lord. And I will bring to pass my will in those places as you step into the gap. And send these young ministers and sustain them as they go. But send them commissioned to do the work of God. Teach them to stand alone, but still to know they have somebody behind them. But I say unto you that you are the architect of the capturing of this entire Nevada and California area. Get to it. Be not afraid. Be bold. I will supply the need. I will show ways to raise money like you have never seen. I'll show you ways to do the work like you've never seen. And I will exalt my name among the heathen because of you. 
	"
}