{
	"title": "Kenneth Copeland Prophecies",
	"header": "Kenneth Copeland Prophecies",
	"fname": "kenneth-copeland-prophesy.html",
	"meta_content": "Kenneth Copeland prophecies over Wisconsin",
	"exclude": false,
	"content": "
These are the last moments of the last days says the Spirit of Grace. This is My time. This is the time prophesied of old. That said the prophets would say, \"Oh, would we had been able to live in that day, when the fullness was manifested.” The most dangerous generation in the history of man, but the most blessed generation in the history of man. If you didn't have what it takes to make it, if you didn't have what it takes to be anointed to that level, if you didn't have what it takes to stand and walk by faith in spite of all that hell can do, God would have had you born some other time. You were born for this hour, you were born to walk in this. You were given birth in order to manifest the glory of God, Hallelujah. If it's God's hour, it's our hour. These are the days that Satan has dreaded and refused to believe whatever exists, but they're on him, they're in his face. He zoomed out and tried his best to kill, steal, and to destroy, but he keeps runnin' into the blood. Yeah, hallelujah. Foreign, ungodly religions will suddenly come to a screeching halt. And even while we stand here tonight, saith the Lord, they are losing their population by the untold millions. I am appearing to people while they're attempting to worship God, don't know who God is, think God is something, or some other thing, but they have a heart to know the truth, and I am appearing to people in strange places, in strange temples, under strange conditions. And I'm telling them they can go over there and find out about Me. They can come over here and find out about Me. You prepare yourself. You prepare yourself. For I am leading people, I am calling people and I'm gonna' call them into your midst. I'm going to call them in through your doors. Make sure you walk in a place of love and not criticism and condemnation. There are going to be people that come through your doors and people that come into your congregations that look strange and sound even stranger. Because they're coming out of foreign ideas and places that are foreign to the things that you know so well. But as they come, some of them are going to be coming out of the braffles, some of them are going to be coming out of the casinos, and gambling places. Some of them are coming off of the streets, some of them are coming out of prisons, some of them are coming out of strange religions, but they're coming hallelujah! And I will have a people saith the Lord, that will walk in My love, and walk in my glory, and walk in a river of the miraculous. Like stepping off into a swiftly running stream, and step out into the edge of it, and all it seems is just wet. But then you get out a little bit deeper, and all of the sudden there's a little current you can feel tugging at your feet and ankles. And you step out a little bit deeper and all of the sudden it becomes stronger, stronger. And you stand back there and say, \"Oh, isn't this wonderful, isn't this wonderful?”…. No! Go on out so far you can't get back! Step out into the flow! Get out into the prayer flow! Get out into the Word flow! Oh, yeah, there's going to be people that'll say, why that's the weirdest, wildest bunch that I've ever heard of in my life, who do they think they are? Why they even, some of them even think they're God! No, we don't think we're God, we know our God! We don't think we're God, we think we're the children of God. And we know in whom we have believed! Hallelujah! Be ready, be strong, but beware. The enemy would try to draw you off into a pit fall, and cause prideful things, and you know better than to fall for that.

Right in the middle of such outpourings of my glory and the miraculous, people will come from far and wide, you've seen some of it. You've seen it in Pensacola, Florida. You've seen it in Brownsville, Texas; you've seen it in other places around the world in years past. But even those are not anything even where close to what is about to come. And it's not just going to be a place here and there; it's going to be all over the place. There's going to be churches in this area by the dozens that haven't got any place to put the people. It is time for the end time transfer of financial goods, wealth, and influence that's mine saith the Lord. And I'm returning it into the hands of my people.

Be ready, but be steady. And in the midst of all that, in the midst of great miracles and shouting and praising, I am looking for a people, and you are it. That right in the middle of all that, that will stand up and say, \"Hey, don't forget the Word of the living God is the source of all these things.” And all of these miracles are wonderful and fabulous, but don't forget the One in our midst that brought it to pass, and His name is Jesus. We stand on the Word. We don't stand on miracles, we stand on the Word. We don't stand on the spectacular, we stand on the supernatural. That is the Word of the living God. And you are My people saith the Lord. Much prayer is called forth here. Seeking the Lord. Prayer in uncommon amounts. People that pray a whole lot, and in strange times of the night. By general public, and even the general population in most churches, are looked upon as weird and strange. But that's the way I look upon people that don't pray, as weird and strange. Amen. You follow the pattern of the Master. Who got up a great while before day and prayed. And then He prayed in the afternoon time and He prayed in the morning time and then He didn't go very long without praying any time. Amen. And that's the kind of people that will commit to sell themselves totally out to the Word of God, and pray. Seek my face and pray. And know, that we're in this together. You've known Me as your Savior. You've known Me as your Healer and Deliverer. You've known Me as the Baptizer in the Holy Ghost. Many of you are knowing Me now and knowing more about my being your Financier. But you're very soon, sooner than you think, you're going to know Me as the Great Resurrection saith the Lord. Give the Lord a shout and a praise, this is our time. Hallelujah. Glory to God, glory to the Lord God. Glory to God. Glory to God. Glory to God. Glory to the Lord. Hallelujah.

If you will learn to speak to Satan, your enemy, boldly, if you will learn to speak to lack, if you will learn to speak in faith to debt, if you will learn to speak in faith to sickness and disease, the strength and the power of your words will grow. What is now will become ten times stronger. And there shortly will become ten times more than that because I am in this, My calling to increase it. And if you will begin to speak the truth in love, you will come to the place where you are irresistible where the devil is concerned, and you are irresistible where the sickness and disease and lack and debt are concerned and you are already more powerful than you think you are. And you will become irresistible to where people are concerned. The devil can't resist you, and people can't resist the love that comes from you. Don't hesitate to minister to others. Don't wait for the pastor to do it. Don't wait for someone else to do it. You begin now; begin in your own prayer closet. Talk to those things that have attempted to set themselves in array against your life and against your finances and against your family. Be very, very, very I say again very cautious about things that would try to divide you and your family and come between you and the ones you love and come between you and your husband or you and your wife in order to create strife in your family and divide your house and conquer you. You be very aware of it, you be very strong against it, and you take a stand and you make up your mind, I'm not falling for that trap anymore! In Jesus' name. Hallelujah, Hallelujah, Hallelujah, Glory to God. I pray right now – let's do this, (tongues) Thank you Jesus. I pray for the governor for this state at this moment. Some things are around him and some people are around him attempting to destroy him. Attempting to destroy the family. God is moving to bring the Holy Ghost into the governorship of the state of Wisconsin. Great Holy Ghost cleansing has begun in this state. In it's politics. I heard the voice of the Lord say, \"I've taken over the politics of this state.” Don't judge it by what the news media says or does, they don't know. But I do. And I'm working there. Hallulujah. 
	"
}