{
	"title": "Dr. Bill Johnson Prophecies",
	"header": "Dr. Bill Johnson Prophecies",
	"fname": "dr-bill-johnson-prophesy.html",
	"meta_content": "Dr. Bill Johnson Prophecies to Pastor Tom and Stella",
	"exclude": false,
	"content": "
Listen, there's been a shaking and a realignment of some things in ministry and purposes and in the people and there's more to come. 
There's a fire of God that's about to show up in your church in the ministry. I mean the fire of the Holy Spirit is going to come. 
You're not a status quo - let's just have a feel-good, let's get together and sing Kum Bah Ya, you're a storming the gates of Hell 
that Heaven can prevail church. You're an active spiritually church you active in intercession. Watch for the watchmen to come into 
the house and intercession to go to another level. But the Lord's saying that we're in a transitional time. The two of you as a 
couple to come into who you really are. You've got leaders that are – well you're versatile in your gifting. You're very relational 
even though you're confrontive, and your transformational because of those two. But I hear the Lord say I'm going to give you some 
Timothy couples to join with you. Some guys that are strong, that are young, not necessarily new Christians, but generationally 
like the 20 - somethings, watch for the youth, watch for the 20 somethings to begin to flow in. And they're looking for fathers and 
mothers and that's who you guys are going to be spiritual parents to those guys like that because you're very much team.

(To Pastor Stella)

And the Lord's going to have the prophetic in you take off. You're going to start prophesying, declaring things. And it's not gong to be, 
\"and the Lord would bless you my daughter” softly – it's going to be - \" AND THE LORD” it's going to be, with a, it's going to be pretty intense. She runs at 78 RPMs instead of 45 or 33. It will be declarative. Declare. Like I see you standing in your front lawn, and your just declaring. And your not yelling it out where the neighbors see it but \"I declare the Word of the Lord. I declare what God's saying. I declare.” I keep hearing that. \"I declare what God's saying,” if it's Sunday morning. \" I declare – I declare this over you by the Spirit of God.” That declarative prayer. Not just, \"well I pray for breakthrough. – I declare your breakthrough in Jesus' name.” That declarative, that affirmation, that prophetess that declares things and knows the secrets of men's hearts. But breakthrough and deliverance and freedom are going to come to people because you're declaring the Word. \"I declare life in there that drives out the darkness.” \"Wow I got free!” \"Well that was an interesting deliverance, it was like the light drives out the darkness.” Well that's the way it's supposed to be, just – bam- but I feel like the Lord's going to make your church more spiritually active – but in a way that brings greater results. So, he's going to harvest the energy that you have even to make it more focused to realize that you're going to add a multiplicational thing. You're going to do some church planting and sending some people out and things of that nature. And you don't have to be, there's nothing in the rulebook that says you got to have this many people before you do this. No, you go by the Holy Spirit. But the Lord's saying, \"Help is on the way”. I'm even bringing peer relationships, people that understand you. Apostolic, prophetic people that can help ya'. That can serve. Like Esther and the prophets like that were helping Cyrus rebuild the temple and the prophets were there and Zerubabel was there and Zachariah and these guys were there. Your going to see, the Lord says I have hidden resources for you that are going to come in. And because there's been a few, there's been some narrow places and there's been like a grip on your finances a little bit. And God says I'm about to break that thing open for you. But watch because you're coming into a new season. It's like winter in the natural spring in the Spirit. You're already past your wintertime. So it's springtime. It's time, I'm mean this is going to be a great season of celebration, rejoicing, worshipping, walking – I feel like worships going to kick up to another place of – it's going to be intense but it's also going to be intimate. And the presence of God is going to be poured out in a great way. Lots of healing. Watch for miracles, watch for healings to come too. So, amen. You've been plowing that land and you haven't seen a harvest to some of the things you thought and you prayed and you declared and you taught. The Lord says answers are coming. And you're gong to see. And you're not going to get a bunch of religious people join you that you've got to unlearn them you know and reprogram. You're going to get some people that are hungry for truth and want to make a difference. You're called to be difference makers guys. Difference makers. And you're on the right track. Hang in there. There's not any quit in either of ya'. That's a good strength that you have.

Now you both are strong leaders and sometimes your swords clash as much. You may go on the way home, \"I think we ought to turn left,” \"No, I think we ought to turn right.” We both are going to end at home. It's just a matter of how we are going to get there. But you know there is a little bit of debating at times, you know. But the Lord says I'm going to course you to flow together in a greater way. And not just have unity but unison of working together too. And not unison being, \"well you do the preaching, you do the children.” It's like no, we are one. I don't know if your church sees you like that but you are so one as so like if it's a Sunday like 2 days, WE do the meeting. So the anointing may come over you – this girl can preach brother, I mean strong. And extortive that way and not in a – it may be very prophetic very extortive. But I see a team thing coming over you real strong. So you're interchangeable. But the unison you're going to have is \"we're on the same page at the same time. Unity can be \"hey I believe the page you're on okay, husband.” \"I believe the page you're on, wife, is okay.” But he's on page 48 and you're on page 46. But if we're in unison we're on the same page at the same time. You're going to see greater efforts come. And it's not going to be as hard okay. You've suffered through he hardship. The Lord says you're going to get the reward and the victory, amen. Victorious living is coming your way. And you're not going to always rob the bee hives and milk the cows and drive out the likes to get to victory either. You're not afraid of doing that, you like to press in. But listen, you bring life to other churches too, watch. Some of the guys that have persecuted you and come against you and doubted you, maybe they haven't said it to your face but they kind of stood off and ostracized you, they're going to come and embrace you in a little bit. Because they're going to see, not that you're greater than but we're all one and you have something they need and they have probably something you can learn from. But you're going to see that they're going to tell you, \" We didn't' understand you cause you're different,” and especially you married a strong lady here brother and she causes religious spirits to manifest. And you've had to suffer the brunt of being called Jezebel, or controlling of that or the other, it hasn't affected you cause you're not that way. You're very submissive to the Lord and to your husband. But some of those biggest critics are going to be some of your biggest fans, you watch. The Lord's going to shift some things around for you. Go for it guys, amen. Let it rip.
	"
}