{
	"title": "Dr. Bill Hohman Prophecies",
	"header": "Dr. Bill Hohman Prophecies",
	"fname": "dr-bill-homan-prophesy.html",
	"meta_content": "Dr. Bill Hohman prophecies to Pastor Tom",
	"exclude": false,
	"content": "
\"It's a new day, it's a new time, it's a new involvement for your lives, for your home, for your church, your congregation, for the mantels not just upon your life, but upon your congregation, upon your region, upon this Midwestern region of the United States. It s beyond a scope of preaching a message or writing a book &mdash; its taking a nation, its taking hold in the spirit realm and standing for a word of declaration. For I'm raising you up both mightily in the prophetic, or the mantle of prophet is upon your home, upon your church, upon your lives. And you will speak governmentally into the heavens. You will cause great strongholds in communities and even this state and this region to be wounded and broken and dismembered and fractioned so that the rejoicing of my people will be sounded in a vibrant and more powerful way\", says the Lord.

I will come not just along side you but I will explode even from within you to live. You will not be able to contain my spirit. You will not be able to contain my voice. You will not be able to contain my strength and my power,\" says the Lord. \"It will be a rupture of your inner most being as enough to explode from your very bellies and your very beings and I will pour out of my spirit says the Lord in a great and profound way in a great and powerful way,\" says the Spirit of God, \"And all the world will shudder literally and my people will rejoice and they will see the mantle. It will be a tangible thing for song and there will be those ministry gifts that will be coming, and shortly, just to hook up and take hold with you and to help hold up your arms. You've done well my man of God; you've done well, my daughter of God. You've done well. And now's the time to reap an incredible harvest, a phenomenal harvest. Not just of an evangelist manner but a harvest of great power and strength for all people,\" says the Lord. \"You will see total revival. You will know total revival. Not just where you are but wherever you go. And your church is being prepared to hold and to bear that up,\" says the spirit of the Lord. \"You're saying, 'Why is there such a long time in this foundation or place? Why is there unseemingly such a long period in this place of solitude in this place of obscurity?'\" For The Lord is saying, \"Yes, it's a time of great, great birthing. It's a time of great foundational growth, so that you can hold and bear up what I am about to do. So that you can take hold of what I am about to pour out of my Spirit and my power and my strength,\" says the Lord. \"For my glory is given to you. And this is that time, this is that hour, this is that day. Rejoice and go forth with boldness. Go forth with a bolder message. Go forth with a rowdy voice. Go forth a stronger confidence and a greater faith,\" says the Lord. \"This is that time and this is that hour,\" says the Lord.

(Paul)

\"I see you guys are like people who get shot out of a cannon, and to the point where your just so ready, 'God this is it,' that it's almost like you run in place so when God says go your 're there. You don't hesitate. You're not people to &mdash; 'Well is this God? I need seven signs and I need 43 wonders. And I'm gonna need this and that. God this is You' - and you go. You take off you're like rockets. And you're going to see doors that just all of the sudden open that you never even dreamed about. And God's doing to give you both dreams and visions when you sleep of places that He will take you. You're going to see these places. You already have of things to come that God is going to start doing within this next year, within these next few months. You're going to see such incredible growth You're just going to take off continually again and again and again, again and again and again, again and again and again, again and again and again - not just a six shot revolver but you're going to be like a machine gun &mdash; (machine gun sound) going, going, going, going, going. And even when you are at home you continue jog in place as you are ready. For anytime the Spirit says go you are ready.

(Woman)

And God says, \"Son and daughter, I am going to bless your obedience, I am going to bless your obedience.

(Woman)

Just as God has been using tongues and interpretation I believe that he going to impart in a great way the gift of faith. And you're going to walk out in things that will blow your socks off. That you're going to be able to impart faith to those that you lay hands on. That you're going to grow in that gift that it's going to be a sign and a wonder to those that are around. A great, great gift of faith God's is imparting to you.

(Bill Hohman)

That gift of faith is going to be the sign of your ministry. Just the gift of faith is um, you know, when Paul starting sharing that, what's being spoken, the Lord started sharing with me. There aren't many that are willing to get into the cannon. So don't be afraid for the explosion. Don't let it shock you and don't let it startle you. You're one of few that are willing to get into the cannon. But you will be launched. You will literally be launched. It won't be something where you see gradual growth and gradual doors opening, but just like what's been spoken, because of that gift of faith that's been given to you, you're going to be launched, just launched. It's almost like &mdash; there you are. But because of the great foundation, the time and the willingness that you've allowed God to put and build within your lives, you will not fall You will not be shattered. You won't be a shooting star. You're going to be a continual fireworks in this world. A continual fireworks in Jesus' name.

(Paul)

And just like you were talking about how the only difference from your youth is that you get more tired. That's not going to be so in your ministry. You're gong to see more energy than you've ever known in your life. Not even just like \"God I'm not tired of ministering\" but physically you can just go and go and go and go and go. You will never be tired of this. Just like this blast of your ministry so will be the blast of fun and just excitement of what God is doing in your ministry.

(Woman)

I just have one word. I just keep hearing it over and over, and the word is&mdash; electric. Electric. Electricity. God just keeps telling me electric, electricity. I don't know exactly what the word means, but just electric. 
	"
}