{
	"title": "Pastor John Pursell Prophecies",
	"header": "Pastor John Pursell Prophecies",
	"fname": "pastor-john-pursell-prophesy.html",
	"meta_content": "Pastor John Pursell prophecies to Pastor Tom and Stella",
	"exclude": false,
	"content": "
(To Pastors Tom and Stella)

As you were ministering tonight I kept sensing this in my heart, that there's an open door that's coming to you. A door of utterance, an open door from God, that's going to be a door of the Holy Ghost. And you'll know it, you'll recognize it when it comes. You'll know it in the Spirit. And as you go through that door, and of course the enemy will try to talk you out of it, and try to persuade you with natural pressure some way, that its not something that you should do but as you follow your heart and go through that open door – the only way I know how to say it is its like the realm of anointing and glory and the things of God that you're in right now, its kind of like being in a room in a house compared to the door you're going through it would be like going into a gymnasium or something, going into a much larger place in the Spirit.

Your influence will go far and wide, the influence of God through you because this is a door of ministry. You've proved yourself faithful. You've stood against the enemy and his plans, and you've stood when it wasn't easy to stand. You've stuck with God and you've held fast to His hand, and so now the door is going to be opened. And it's going to be a large door, a prosperous place, a place of blessing, a place where the people are going to be blessed. Instead of a river, there will be rivers of living water flowing forth from you. And it will be so large and so great and so powerful that you won't be able to do it all by yourself.

You'll find yourselves at times laying hands on others and there will be an impartation as there was from Moses to Joshua where that person will be able to go with that which is in you having been deposited in them. And they'll run in that same anointing. They'll be able to help you, they'll be able to do the things that you just physically and humanly cannot do. Those spiritual sons and daughters that God is giving you. So go through that door when it shows up, when you see it, when you know it, when it comes up before you just step through it. And much of the stirring that's been in your heart lately is because of the preparation of the Spirit of God to bring you to that door. We get stirred up on the insides sometimes and we start thinking, \"Was it this?\" or \"Should I do that?\" Or we just try to start figuring out what's going on and God's saying I'm stirring you up because I've got something else coming and I want you to be ready. I don't want you to be comfortable I want you to be looking and hoping and expecting and believing and knowing that there's a new door ahead. And so look for it. Walk through it and you'll be blessed.

Thank you Jesus.
	"
}