{
	"title": "Thomas C. Terry Prophecies",
	"header": "Thomas C. Terry Prophecies",
	"fname": "thomas-c-terry-prophesy.html",
	"meta_content": "Thomas C. Terry Prophecies about the year 2008",
	"exclude": false,
	"content": "
This will be a year of political and spiritual upheaval - I will demand that my people listen to My voice when voting. Those who have done so in the last election and will do so in this election - no matter what the outcome - I will bless and prosper as long as all other principles in my Word are also in play in their lives concerning sowing and reaping. Those who get caught up in emotions and wrong leadings and listen to family, friends, and co-workers and vote for the wrong people, as some did last time, will not be protected from financial downfalls by my supernatural power, unless they realize what they have done and quickly repent. For those who won't, even My people, will suffer much lack, frustration, and even bankruptcy. For those who do listen and have been faithful, my supernatural power will bless them in ways many of them have not yet seen. Your vote and voice is important. It will not be up to the world to decide this election but it will be up to My people. This is a warning before it happens.

This will be a year when many who have relied on men's ways and men's ideas about church and Christianity will be dealt with by Me. Many will repent; even leaders, and will openly apologize for misleading My people from the Word and the supernatural. Many will be dealt with and will not repent because their motives will be wrong. You will openly see the results of their errors and rebellion. Pray for them as the path will be hard for those who don't repent and seek Me. Over time many will see the truth and repent and be spared - if you will pray.

This will be a year of a Spirit of prayer and a Spirit of intersession that will come to all those who will yield. As My spirit-led people will yield to Me through their prayers I will release a mighty dealing amongst the leaders in the natural realm, the 5-fold ministry, elders and other leaders in the spiritual realm. Be ready for what you shall see, for some of the results will be shocking as some heroes will come crashing down. Yet, it is for the best, for I will cleanse and purify the motives of all who will yield. Those who yield to my delivering power shall come out of long-time bondage, habits and sickness this year. Back sliders will come home and alters shall be full.

This will be the year of the Baptism of the Holy Ghost and fire for many. The next 5 years I will raise up many to restore this vital message to my body. This will all be initiated by My prayers across the land and the nations.

It's time to pray, call out, and travail.

It's time to put down distractions -  foolishness, TV time, and distractions.

It's time to stop saying and knowing what to do just.

It's time for action. If action is taken by the majority of the people of God this year, the world will be impacted in a way that you will tangibly see and understand for the better. It will amaze many. If not, the world will be impacted in a negative way. You will see many tangible results and you will not rejoice for mourning will come.

This will be a year of exposure of the false and exultation of the true. Many false ministries, leaders, apostles and prophets will be exposed, and some churches who let them in will be embarrassed. Their people will lose confidence in their pastoral leadership because they let them in and hooked up with them, only to be found false. This will hurt those churches. I have sent true apostles and prophets to warn you. Take heed and listen, for your foolishness will be shown to all men. Hear what the Spirit will say to the churches. My true apostles and prophets will rise up with a true word of the Lord that cuts through all religious jargon and goes to the heart.

Satanic strongholds will be dealt with in ways not seen since the beginning of My church. It will happen this year - write it down.

I am sending My Spirit and My Word. I will deal with My people. I will have My way. Satan is a defeated foe. I will remove his influence from those who are sincere and it will happen this year. If you will hear, hear what the Spirit will say to the churches.

This also will be a year of restoration in many homes, marriages, families, ministries and churches. It all revolves around prayer. Prayer-prayer-prayer, and more prayer.

Will you listen? Will you heed? Will you, My people, humble yourselves? Will you seek my face, turn from your wicked ways and pray? If you do I will send healing and deliverance to the land.

One more thing - I will deal with you very strongly concerning three things: money, politics and the gifts of the Spirit and their importance. Will you hear and obey?
	"
}