{
	"title": "Ambassador Huggins Prophecies in 2009",
	"header": "Ambassador Huggins Prophecies in 2009",
	'fname': "ambassador-huggins-prophesy-2009.html",
	"meta_content": "The Holy Ghost lays it on thick through the voice of the prophet Ambassador Larry Huggins",
	"exclude": false,
	"content": "
The Lord has brought you here tonight. The steps of good men are ordered by the Lord. You could be a lot of places. But you are here because it is God's will for us to be here. It's God's will that Pastor Tom and Pastor Stella are here with us from Sturgeon Bay. God wants to do something special amongst us tonight and He wants you to be a part of it.

(To Pastor Stella)

For you my daughter shine in the Heavens for Eternity as a star and from your place in the Heavens above you look down up on the Earth with eyes of faith and love. And you see things form heavens point of view. And that's why I use you because you take the high road and you look down from above. You understand that God has a plan for man and that's what you speak of. Not of the natural but of the eternal. For this natural life is but for a moment and Heaven is forever.

(To Pastor Tom)

Oh they that would win souls is wise and shall shine in the firmament as stars forever. And you my son are a soul winner. And you have cried out to me for souls. And I will give you revivals that will cause multitudes to be swept out of darkness and into light; swept out of death into life. See them; see the crowds, scattered, confused, abused, forlorn, misused, abused. I've given you a heart for the multitudes. You've cried over them, you've wept. You, my son, are a soul winner. I'm opening doors of utterance. Where you have spoken to ten you will speak to a thousand. Where you have spoken to a thousand you will speak to ten thousand. And you will be among those who speak to millions, it's true. It's not impossible for Me. And I'll make it possible for you. I'm going to open a door that no one can open and you will walk through and you'll have an audience bigger than you have ever dreamed. Because when I find a man who loves souls I want to use him.

You can have a flight of exultation and when your spirit leaves your body. And if it happens it's because of His power. If He brings you back again it's because you need to minister to people. Tell them what God said. And tell them what you've seen. And tell them what you know. And pray that God will show.

Yea – your heads in the cloud, the glory cloud. Things are clear when your heads in the glory cloud. You can see things far as though they were near. When you're in the glory cloud you're not really here when you're in the glory cloud. But you're near even when you're not here, because you're occupying two realms. You're in the world but not of the world. Your feet are on the Earth, but your spirit is in Heaven above; transcending all distance through the medium of love, connected to the heart of the Father and you can be reeled right into the closest place possible, seated with Him. Did you know you can go as high as you want to in God? I sense that you want to go higher in God. Am I right? Adventures in the Spirit. Wow, adventures in the inner space, the kingdom of God is within you. Exploring the kingdoms of glory, walking where few men have walked along the crystal sea. Alongside the River of Life, standing before the throne.

It's an honor to have you here tonight Pastor Tom. Sometimes we think when we don't have some preaching we are doing a disservice, but sometimes we are doing a disservice when we should be ministering to them by the Spirit. We do plenty of preaching. We don't come behind in preaching. We got enough Word to start a revival in Panama. We don't come behind in the Word, we come behind in acting on the Word. So tonight we are acting on the Word. Tonight I want to talk to you about the economy. I want to talk to all your congregation kind of in proxy to you because you represent people who aren't here tonight. Your parishioners, your family, your friends, people you have been sent to. People you're now in relationship with and the people you will soon be sent to. Future people.

I want to talk to you about the economy. There is no shortage of anything, anywhere in God's universe. There is no shortage of anything anywhere in God's universe. There's no shortage on his planet. There is no shortage of energy. There is no shortage of fossil fuels. No shortage of natural resources. There is no shortage of money. There is estimated that there is 19 decillion dollars in the world's economy. What does that mean? It means if you divide six billion people into it, every human being is worth hundreds of millions if not billions of dollars. Where there is a shortage of is supply. It's heaped up in vaults and in bank accounts and offshore. And in funds that are controlled by worldly people. By bankers who see people as cattle and they invest in wars because there is money in it. And they create shortages so that they can heap more money up. During the Lebanese War every war lord wanted to have a little corridor to the Mediterranean. And that all they wanted the Jews, the Shiites and the Sunni and Muslims and the Christians every war lord wanted to have a hundred yards of beach where they could land a raft or a boat filled with anything they could get in it; toilet paper, aspirin, soap, shampoo, because there was not any of that stuff in Lebanon and people would pay ten dollars for a roll of toilet paper and as long as that country was in a perpetual state of war, war lords made out like bandits because they were bandits they had their own black market and they would go to Cypress and they would go to Italy and Greece and Romania and they would buy anything they could. And people had rolls of 100 dollar bills and buckets full of 100 dollar bills. Let me tell you something. That's evil and greedy when people oppress other people just for money. This so called shortage is not a shortage. Right now big banks are buying up little banks and instead of giving relief to the lenders, which is biblically opposite. All they would have to do is give people a little tax credit and tax relief and forgive them a payment or two on their mortgage and we would have a Jubilee. Money would go into the economy. It would be stimulated and everyone would be out spending money and going on vacation. This is manufactured. This is a manufactured recession. This is manufactured by bankers. It is a conspiracy. A conspiracy of vil. It's too smart to be a conspiracy of men. Its principalities and powers and wicked spirits in Heavenly places. Remember, it's satan. Who showed Jesus all the kingdoms of the world in a moment of time in all their glory and all their wealth? And he said all this is your if you will bow down and worship me, and it's yours. It's been delivered unto me to give it to whosoever I will. And it's all your if you just bow down and worship me. But I'm here to tell you if the wealth of the wicked is laid up for the just and they are heaping it up for the last days and for the righteous, I'm here to tell you that there is going to be a transfer, but it's a reversal of the direction they think it's going to go. Instead of flowing to them it's going to flow to the Church. Not it's going to flow for the true believers who know their God and trust their God and obey their God and walk in the Spirit and don't walk in the flesh and don't walk in the natural and don't walk in the fear and don't listen to the false counselors but listen to the true Counselor, the Holy Ghost of God who leads u into all Truth. And those of us who walk in the Spirit are going to be the stewards of great sums of money and we will show people where the money is, where the jobs are, where the opportunities are. And another economy is going to grow out of this economy and it's going to be the economy of God and there's not going to be any weak among us, and there's not going to be any sick among us, and there is not going to be any poor among us. This is the will of God.

I come against the prophets of doom and gloom and I say that a Golden Age is coming to the church of the born-again, the kingdom of God is not weak and the kingdom of God is not poor. So you're going to have to tell people, as you have, that this is a false economy, that there is no shortage in the true economy. You're going to have to inspire faith in them because once it catches on its going to start sucking the gold and silver out of the world's system. So Tom, you're going to have to make a decision right now. Is supernatural prosperity a problem for you? No indeed.

Money, money, money, money, money, one word from Heaven, one prophetic utterance can create a business. With a man who is destitute and he can go from poverty to penury to prosperity because he's taken heed to the living God who lives inside of you. You will speak out jobs, you will declare industries. And it will come to pass. And as you continue to do this it will multiply. And it will happen fast. Everywhere you go two revivals will, are going to break out. A revival of souls and a revival of gold. (To Pastor Stella) Do you have any problem being married to a wealthy man?

The thoughts of the diligent think only on plenty. Think on plenty, think on prosperity. Think on fullness, think on it. The thoughts of the diligent every day, every day, every day, every way, everyway, everyway, to meditate on the goodness and the fullness and the richness and the bigness of God. His eyes are not dim. His ears are not dull, neither is His arm short. There is nothing He will withhold from them who will walk upright in His sight. Prosperity is a fact of God's economy. Back in the early days of my ministry when I was the co-founder, vice-president, associate pastor, and missions director of Faith Christian Fellowship, we had a perpetual move of the Spirit on our services. Visible glory every day. I don't think we ever met that we didn't have wonderful services. People lined up at the door to get in. You couldn't wait to get to church. Always signs and wonders and tongues and interpretation of tongues and prophecies. And God started doing something in the church. He started speaking out jobs. He would say, \"I want someone to start a fence company” and someone would pick up on it and start with 5 dollars and go start it and prosper. We had construction companies started and insurance companies started by the word of the Lord. We prophesied them out. We would prophesy cars, we would say, \"there is someone here believing for a car and there is somebody here with a car to give away” and they would come give the pink slip to them right in church. There's someone who needs a job and someone needs a worker, and they would go together right there in church. We did this every Sunday. It was very rare that this didn't happen. We would, by the Spirit, make connections. Now with that comes the gift of faith. Because you know when God said it then God's going to perform it. It's not just a good idea, it's a God idea. We need to start moving back into that Pastors. We need to start prophesying prosperity and listening to God for divine opportunity and speak them out. We are the men of God; they ought to be coming to us for financial counsel. Why? The financial genius lives on the inside of us, the Holy Ghost. Abraham was rich in houses and land and silver and gold and menservants and maidservants. Why? Because he followed God. Jacob sowed in a famine and reaped 100 fold. Why? He listened to God. The glory came to Obadiah's farm and in three months he became rich and retired and became a singer in the choir. Why? Because the glory of God came to his farm.

Pastor Terry, last year Brother Rodney Howard Browne called me and said, \"Come and spend the day with me.” So I spent about a day and a half with him and we went to a church over at Benny Hinn's brother's church. And Dr. Browne called the ministers up and said I want to bless you preachers. And about 20 preachers came up. I didn't want to go up but I did and I didn't want to go under the power, but I did. And I stayed down there for about 30 minutes. Glad I didn't. The Holy Ghost spoke to me. He said, \"Tomorrow I'm going to bless you financially,” when I was on the floor sucking carpet under the glory. The Holy Ghost spoke to me and said, \"Tomorrow I'm going to bless you financially.” So the next day I woke up expecting to get blessed financially because God said it. Wasn't too long the same day that the phone rang, it was two guys from Nevada. They said you don't know us, but we know you and we have gold mines in South America and we are sending you 10 thousand shares of our gold mine. Hang onto it, because we are going public and gold is going to go through the roof pretty soon. Guess what happened since the economy went south. Gold has gone north. Hallelujah, praise God! Amen! I went down on the carpet and came up owning a gold mine!
And they will give it to you and heap it up! And pour it on you until it's almost too much and it will overflow and run out of you. And it will be more than you can ever use. Even tonight, while you're under the power, my glory and wealth and riches are being added unto you (Larry to Stella) and to you.

(To Pastor Tom)

Mr. Carnegie built libraries all over the world. He set up trusts and they're still making money today because of the simple interest that they incur grows so fast that they can't find enough legitimate projects to put them in. (To the crowd) There is money – how would you like to be a philanthropist? How would you like to send people to school, set up a scholarship fund, help a missionary like Tom reach a nation? How would you like to support the Christian Ambassador and be a part of something that's big? How would you like to have a ministry that's dedicated to being able to give? That is a ministry, the ministry of giving. If you would like to move into the most noble of ministries, move into the ministry of giving. The closest to God's heart. Because that's what God does and who He is. He's the philanthropist, He's the one who gives everything and loves giving and lives to give. He gave the Heavens and the earth and the starts and the sun and the birds and moon and planets and flowers and fish, animals and trees to you and me.

(Pastor Tom gets up off floor.)

And He gave us dominion and ability and when we were lost in sin He came and gave us Jesus to rescue us. And when He rescued us He gave us the Holy Ghost to fill us with power and He gave us the Word of God. And He gave us the ministry gifts; Apostles, Prophets, Evangelists, Pastors and Teachers. He gave us the gifts of the Spirit; words of wisdom and words of knowledge and words of power! And He keeps on giving and He has put in the church something called the ministry of giving.

(To Pastor Tom and Stella)

See, you give continuously. Not just of your money but of something even more precious, your faith, your time, your compassion, your wisdom, your life is poured out like water to other people, you don't hold back anything. People don't understand preachers. They think preachers are in it to get. I wouldn't work this hard.

(Larry to Pastor Tom and Stella)

What you have just seen is a demonstration of divers tongues and interpretation of tongues. Divers tongues is a New Testament gift you can read about in 1 Cor. 12 and 14. To one is given a tongue and to another the interpretation. And this is not just the private devotional tongue and interpretation, but the public ministry gift of tongues and interpretation and there are certain principles that govern this in any church. Everything done here is decent and in order and appropriate.

Now – one of my mentors and a person who had a great impact on me in my early Christian walk was a couple by the name of J.R. Goodwin and his wife; we called her Momma Goodwin and him Dad Goodwin or Pop. Brother Hagin held him in high esteem and Pop Goodwin was Brother Hagin's best friend on the earth. I was close enough that not only did I associate with him and was prayed for and watched them minister, but I was at Pop Goodwin's Home-Going service as well. Brother Hagin wept and wept and wept and people tried to console Brother Hagin and he stiff-armed them. He didn't want to be consoled, he wanted to mourn the loss of his friend and rejoice in his Home-Going.

I've seen two other couples who really personify that type of ministry with excellence who remind me of J.R. Goodwin and Momma Goodwin. And Tom and Stella are one of those two couples. The church needs this ministry. And I don't think you do hold back, to have the kind of ease and skill that you move in. I know that you allow God to use you often. But I want to encourage you to keep doing it. And don't stop, it's powerful. And some things will happen through divers tongues and interpretation that will not happen through the simple gift of prophecy. Praise God. Givers tongues and interpretation in the local church we need to see more of this. And not necessarily among the top echelon of the church, but also in the second and third rings. The bibles says when something has been revealed to the second let the fist hold his peace. The first in authority or stature. So the number one guy has to yield to someone else. I did that tonight. I happen to be the #1 in this case because I have been asked to ministry and I've been standing in that office and have been supervising under the pastors watch of this service, so notice they didn't interrupt, they didn't take over, they just waited and when the #1 guy recognized that someone in the second circle, that God wanted to use them, then the #1 guy, I had to hold my peace – the baton passes. And that's the way it works. He passes it back to me. Now if we were having a believer's meeting, we might stay in the second circle for a while or we might go to the third circle. Now, who is the second circle? The second circle of all those who are not Neophytes. They are ones who know how to be used of God, they are experienced. They are trustworthy. And there are no question marks there. You now sometimes when people get a microphone you don't know what they are going to do, but those who have been proven you can trust their gift and trust them. Well, that's the second circle. And the third circle are the people who are learning and the only way they can learn is to have an opportunity and very, very rarely today does the baton go to the second circle, let alone the third circle. We need to fix that. We need to have some believer's meetings. 
	"
}