{
	"title": "Meet the Pastors",
	"header": "Meet the Pastors",
	"meta_content": "A brief biography of Pastor Thomas C. Terry and his lovely wife Miss Stella as well as Family Pastors Tim and Jennifer Kornowski",
	"exclude": false,
	"content": "
<b>Thomas C. Terry</b> and his wife <b>Stella</b> have been serving in the ministry for 37 years. They have worked in all areas of ministry such as street witnessing, jail ministry, leading bible studies, serving the children and youth and working in all other aspects of helps ministry. They have served as deacons and elders, later becoming associate pastors. They established their first church in Reno, NV and through the years have established churches in California, Oregon, Wisconsin and Pakistan.

Thomas and Stella Terry are well-known for teaching the uncompromising Word of God and have a strong ministry of prayer and intercession. Powerful signs and wonders follow them including creative miracles, healings and deliverance from evil spirits as they travel throughout the United States and abroad. They are known as experts in the teaching and demonstration of the gifts of the Spirit, healing, deliverance, church government and leadership. They flow proficiently in the gift of tongues and interpretation with a demonstration of miracles through this gift that the church world needs to see. Recently the Lord has had them working hands-on with youth who are hungry for God, teaching them how to pray for the sick and move in the Holy Ghost. They minister in conventions and seminars, Holy Ghost meetings, church revivals and missions and crusade work overseas.

With a deep love for their Lord Jesus Christ, they fulfill roles of spiritual parents, life coaches and counselors to many, with one purpose in mind; to win souls for the kingdom of God. They are now reaching hundreds of thousands with the message of salvation and the baptism of the Holy Spirit through their traveling ministry, books, Television, Radio, Internet and Social Media. Thirty-seven years of ministry has given them wisdom that is much needed in the body of Christ today.

<a href='https://www.facebook.com/thomas.c.terry'><div id='Facebook'></div></a>
<a href='https://www.youtube.com/user/MrThomascterry'><div id='Youtube'></div></a>
<a href='https://twitter.com/wildmanfromWisc'><div id='Twitter'></div></a>
<a href='https://plus.google.com/100356734350950392592/posts'><div id='Google'></div></a>
<a href='https://www.linkedin.com/pub/thomas-terry/47/7b0/782'><div id='LinkedIn'></div></a>
<a href='https://www.periscope.tv/wildmanfromWisc'><div id='Periscope'></div></a><br><br><br>
<hr>
Pastor <b>Tim and Jennifer Kornowski</b> are the associate pastors of Faith Alive Fellowship. They work in the ministry of family pastors. They both teach and preach in the church and serve where needed in all areas of ministry at Faith Alive Fellowship.
	"
}