{
	"title": "What We Believe",
	"header": "What We Believe",
	"meta_content": "Our programs and activities here at Faith Alive Fellowship are founded on several biblical truths and beliefs, our church doctrine and respective scriptures. ",
	"exclude": false,
	"content": "
<h3>Section I.</h3>
We believe that the Bible is the inspired Word of God Equally in all parts and without error in its original manuscript, absolutely infallible, and our source of supreme revelation from God, superior to conscience and reason, though not contrary to reason; and it is therefore our infallible rule of faith and practice.
(II Timothy 3:16-17; I Peter 1:23-25; Hebrews 4:12.)

<h3>Section II.</h3>
We believe in one God who has revealed Himself in three persons, the Father, the Son and the Holy Ghost. The Father, the Son, and the Holy Ghost are all co-eternal, all stand equally superior to time, free from the temporal distinctions of past and future.

    The Eternal FATHER &mdash; (Genesis 12:33; Deuteronomy 33:27; Psalms 90:2; Psalms 102:27; I Timothy 1:17.)<br>
    The Eternal SON &mdash; (John 1:1-2; John 8:58; Hebrews 1:8; 1 John 1:2; Micah 5:2; Revelation 1:8.)<br>
    The Eternal SPIRIT &mdash; (Hebrews 9:14.)<br>
    The Eternal GODHEAD &mdash; (Romans 1:20.)

<h3>Section III.</h3>
We believe in the pre-existence, incarnation and virgin birth of Jesus Christ who came into the world to reveal the Father, and was the brightness of His glory and the express image of His person; that Jesus Christ was the Creator of all things, for Him the worlds were made. We further believe that in Christ dwelt all the fullness of the Godhead bodily and that He was very God and very Man. (John 1:1-2 & 14; I Timothy 3:16; Acts 7:37-38.)

<h3>Section IV.</h3>
We believe in Jesus Christ's sinless life, miracles, sub-situational 
death, bodily resurrection and His ascension into Heaven, and 
acknowledge His Lordship&mdash;that Jesus Christ is Lord over all things 
in heaven and in earth, and under earth. (Philippians 2:9-10.)

<h3>Section V.</h3>
We believe that man was created by a direct and immediate act of God. 
(Genesis 1:26-27; 2:4.)

<h3>Section VI.</h3>
We believe that man by transgression fell from a state of righteousness 
and holiness in which he was first created, into total spiritual depravity, 
a state of death in trespasses and sins in which he is held as a slave of 
sin and an enemy of God, being unable to attain divine righteousness by 
his own efforts, but must be redeemed and delivered by the power of the 
Gospel. (Romans 5:12-21; I Corinthians 15:1-4.)

<h3>Section VII.</h3>
We believe that each believer must lay a foundation of Biblical truth 
and experience upon which he builds his life. These \"foundation stones\" 
are: repentance from dead works, faith toward God, doctrine of baptisms, laying on of hands, resurrection of the dead, eternal judgment and perfection. (Hebrews 6:1-3).

<h3>Section VIII.</h3>
We believe that repentance and faith toward our Lord Jesus Christ produces the work of justification in the believer. Through faith in the shed blood of Christ, he is justified and made a partaker in the death of Christ. This is the initial step of salvation. (Romans 5:1,9; Luke 22:20.)

<h3>Section IX.</h3>
We believe that water baptism is an essential and necessary part of 
the \"doctrine of baptisms\", Hebrews 6:2, performed only upon repentant 
believers in the name of the Father, Son and Holy Ghost. (Matthew 28:19.) 
This act is to be done by immersion.

<h3>Section X.</h3>
We believe in the baptism of the Holy Ghost according to 
(Acts 2:4; 10:46; 19:6) that speaking in other tongues is 
the accompanying sign of receiving the baptism of the Holy Ghost. 
(Mark 16:17.) We also hold that the real evidence of the baptism of 
the Holy Ghost is one's response to the Word of God. (John 16:13), a 
Christ-like life, showing forth Christ's character, nature and 
experiencing and manifesting the fruit of the Holy Ghost. 
(John 15:26; 16:14; Galatians 5:22-23.)

<h3>Section XI.</h3>
We believe in the doctrine of the laying on of hands for:

    a) The confirming of believers faith. (Acts 14:22.)<br>
    b) The confirmation of one's call by the laying on of hands with prophecy. (Acts 13:1,3.)<br>
    c) The importation of the spiritual gifts when accompanied by prophecy and the laying on of hands. (I Timothy 4:14; II Timothy 1:6.)<br>
    d) The ordination and official recognition and setting apart for the ministry.<br>
    e) The impartation of the gift of the Holy Ghost. (Acts 8:17-18.)<br>
    f) The ministry of healing the sick. (Mark 16:16.)<br>
    g) The blessing and dedication (setting apart) of children. (Mark 10:16.)

<h3>Section XII.</h3>
We believe in the five-fold ministries given to the Church at the ascension of Jesus Christ and that they continue to be needed and should be expected today, that is ministries of apostles, prophets, evangelists, pastors and teachers. (Ephesians 4:11-12.)

<h3>Section XIII.</h3>
We believe in the New Testament order for the local church is its 
government, structure and worship. Five-fold ministries: Apostles, 
Prophets, Evangelists, Pastors and Teachers (Ephesians 4:11; 
Titus 1:5-9; I Timothy 3:8-13) Deacons (Acts 6:1-7; Philippians 1:1; 
I Timothy 3:8-13) Helpers, Administrators, (I Corinthians 12:28-Amplified) 
and those able and appointed to lead in Music and Worship 
(I Chronicles 23:1-5). We believe in Pastoral accountability and 
authority (Hebrews 13:17). Ordination and commissioning in this 
church is a separation and recognition of a specific gifting of God. 
We believe that God calls men and women into specific ministries as 
Apostles, Prophets, Evangelists, Pastors and Teachers. God calls, 
man can only recognize the call and acknowledge it. Ordination is on 
the basis of that recognition of God's gifting. Men and women called 
to specific office by God and ordained or commissioned by this church 
will have the right to participate in the traditional sacramental and 
ordinal functions of the church such as marriage, funerals, baptisms, 
and the like. They shall also be expected to function in the spiritual 
giftings of their office and to demonstrate the reality of their 
calling. We reject the efficacy of ritual and the concept of a separate 
priestly class. We recognize the priesthood of believers and the serving 
ministry of the Apostle, Prophet, Evangelist, Pastor and Teacher with 
government by these Elders. As such we recognize that those called to 
those offices will function in a manner to lead by example in prayer, 
worship, teaching, laying on of hands, and prophesying and that such 
actions on the part of those ordained and commissioned by this church 
would be compared to the sacramental function of the priesthood in 
traditional sacramental churches.

<h3>Section XIV.</h3>
We believe that \"by grace are ye saved though faith and that not of yourselves; it is the gift of God, not by works lest any man should boast.\" (Ephesians 2:8-9) We further believe that the emphasis for a continuous walk in grace should be the emphasis of heart righteousness and purity, believing in the keeping power of God, walking after the spirit and not after the flesh in a lifestyle that demonstrates the character, standards and convictions of Jesus Christ, not being conformed to the world (Jude 24; Romans 8:25; Galatians 5:16-25; Romans 12:1-2).

<h3>Section XV.</h3>
We believe in the practice of worship with one's total being as set forth in the Word of God. (Acts 24:14; Ephesians 5:18-19; Psalms 150).

<h3>Section XVI.</h3>
We believe that the ministry of the Holy Spirit is being manifested in the Church through the fruits, (Galatians 5:22-23-graces, ministries and gifts) and we hold that the nine gifts of the Spirit, (I Corinthians 12:8-11) should be and must be operative in the Church today in order for the Church to enjoy the fullness of God. Also, we hold that these gifts are imparted by the sovereignty of the Holy Spirit and only work or operate by the one and self-same Spirit. (I Corinthians 12:11).

<h3>Section XVII.</h3>
We believe in divine healing for the whole man. Healing was obtained through the atonement in Christ's sacrificial death (I Peter 2:24-25; Isaiah 53:4-5). We believe in healing as practiced by the early church (Acts 4:30; 19:11; Romans 8:11; I Corinthians 12:9; James 5:14).

<h3>Section XVIII.</h3>
We believe that we are one body, being members of one another and that the basis of our fellowship is in Christ in the power of the Spirit. (Ephesians 2:13-22; 4:3-6; I John 1:6-7)

<h3>Section XIX.</h3>
We believe that the Church is the Body of Christ expressed as the church individual, the church local, and the church universal and invisible (all saints of all places and all times united together under one Lord). As such, we believe the church to be more than just a building or a gathering of people. It is a body living in relationship and harmony under the directions of the head, Jesus Christ (I Corinthians 6:15; II Corinthians 1:1; Romans 16:5; I peter 2:4-5; Ephesians 2:19-22; I Corinthians 12:12-31; Romans 12:4-5; Ephesians 4:11-16). The local church is an expression of the community and fellowship of God. As the Body of Christ in the earth it is an intimate community of people that is devoted to apostolic teaching, to fellowship, breaking of bread and prayer. The local body will meet together regularly as a whole and in smaller groups in the homes of members of the congregation. We consider the fellowship of the saints together in the private homes of the members to be an essential expression of the life of faith of the church. Indeed to this end, the Word of God frequently refers to the church as a \"household.\" (Matthew 16:13-20, 18:15-20; Acts 2:41-47; I Peter 4:17; I Timothy 3:15; Ephesians 2:19; I Peter 2:5; Acts 18:8; Romans 16:5, 10, 11; I Corinthians 1:11, 16; 16:15, 19; Philippians 4:22; Colossians 4:15, II Timothy 1:16; 4:19.)

<h3>Section XX.</h3>
We believe in church discipline administered within the church in a spirit of meekness and confidentiality. The purpose of such discipline is the restoration of the one subject to the discipline and/or the purification of the church. The steps of discipline are one on one private confrontation, private confrontation and witnesses, and finally, exposure to the church, Board of Advisors and/or the congregation for judgment leading to restoration or separation. (Matthew 18:15-20; Galatians 6:1; Romans 16:17; II John 9:11; I Corinthians 5; II Corinthians 2:6-8; I Timothy 5:20).

<h3>Section XXI.</h3>
We believe as members of the same body of Christ, baptized by one Spirit into one body that we must endeavor to keep the unity of the Spirit in the bond of peace and as such that we are discouraged from bringing a lawsuit in a civil court against another person who professes to be a Christian or against a Christian ministry. We believe that all such disputes should be resolved within the Body of Christ without taking them before unbelievers for judgment. (I Corinthians 6:1-8; Ephesians 4:3-6).

<h3>Section XXII.</h3>
We believe that faith without works is dead. We do not believe, as a matter of the fundamental beliefs and doctrines of this church, that any matter can be believed without there being an accompanying and corresponding action. Our faith is an active faith that requires the doing of acts in the world. Our faith is not a passive or complacent system of intellectual belief or assent to doctrine but is an active force in our lives that requires and results in actions being taken. A living, active faith will be manifested not only in belief and mental assent, but in actions expressing and based upon that belief. If a belief is truly held it will be acted upon. The act is as much a fundamental aspect of our faith as the belief upon which the act is based. (James 2:14-26; Ephesians 2:8-10; Matthew 7:21; Matthew 7:24-27; Matthew 5:16; II Corinthians 5:10; Matthew 16:27; Revelations 2:23; Revelations 22:12).

<h3>Section XXIII.</h3>
We believe that in all matters concerning the Body of Christ, in its direction, discipline, ministry and functioning that specific guidance and instruction, revelation and discernment of truth from falsehood, is available by the leading of the Holy Ghost who enables us to know spiritual things by the spirit and we are confident in basing decisions and actions upon such faith and direction. (Acts 13:1-3; I Timothy 1:18; Romans 8:14; I Timothy 5:22; John 16:13-15; I Corinthians 5:3).

<h3>Section XXIV.</h3>
We believe in Christ's bodily ascension into heaven, in His exaltation and His personal return in power and great glory, and His everlasting Kingdom and dominion. (Acts 1:11; 3:19-21; Daniel 7:14; Revelation 20:4).

<h3>Section XXV.</h3>
We believe that the fearful, the unbelieving, the abominable, whoremongers, sorcerers, idolater and liars shall have their part in the lake which burneth with fire and brimstone, which is the second death. (Revelation 21:8).

<h3>Section XXVI.</h3>
We believe that there shall be a new heaven and a new earth wherein dwelleth righteousness. (II Peter 3:13; Revelation 21:1).

<h3>Section XXVII.</h3>
We believe in the reality and personality of Satan, (Job 1:7; Matthew 4:1-11) and that he was defeated by Christ through His death, burial and resurrection at Calvary (Ephesians 1:19-23; Colossians 2:15) and that Christ has delegated His Authority over all the works of Satan to His body the Church. (Matthew 28:18-20).

<h3>Section XXVIII.</h3>
We believe a divinely called and scripturally ordained ministry is provided by our Lord Jesus Christ, the Head of the Church, for the two-fold purpose of the evangelization of the world and of the edification and oversight of the Body of Christ. (Mark 16:15-20; Ephesians 4:8-13; Acts 20:28).

<h3>Section XXIX.</h3>
We believe that there is the occasional need for deliverance. Deliverance is manifested by an inability to be free from a bondage; e.g., mental (emotional), physical or spiritual normally associated with demon activity, it is God's desire to bring deliverance to His people. (Job 5:19, Psalms 91:3; II Timothy 4:13; Hebrews 2:15; II Peter 2:9) We have been granted the authority in the name of Jesus to bring deliverance to others. (Mark 16:17; John 14:12; I Corinthians 12:8-11). We must understand that our warfare is with the forces of evil (Ephesians 6:12), our weapon is the Word of God, our authority and power is from Jesus Himself (Mark 16:17, Acts 1:8) and that the battlefield is first of all in the spiritual realms. (Ephesians 6:10-18; II Corinthians 10:3-5; Romans 8:9; Galatians 5:22-23).

<h3>Section XXX.</h3>
We believe in the creation and God as the Creator. We believe that God created man and that He created them male and female. As such He created them different so as to complement and complete each other. God instituted monogamous marriage between male and female as the foundation of the family, the basic structure of human society. For this reason homosexuality is unnatural, sinful and unacceptable to God.

<h3>Section XXXI.</h3>
We believe that repentance is a gift from God. It is simply not true that a person can repent at any time. Repentance is dependent upon the conviction action of the Holy Ghost in the lives of sinners and believers. The conviction of the Holy Ghost, which often accompanies the preaching of the Gospel of Jesus Christ, will result in the revelation of the sinfulness of self, which should lead to Godly sorrow. Remorse, or worldly sorrow, is a feeling of deep regret, hopelessness or even despair. It does not lead to constructive change. On the other hand Godly sorrow, which may at times be mistaken for worldly sorrow, produces repentance, which causes us to turn away from sin and selfishness and to receive faith for change. Worldly sorrow is destructive, but repentance is life giving. Repentance changes the way we feel and act about sin, self and God. Repentance is a total change of heart, mind, attitude, emotions, will, action and lifestyle flowing from the turmoil and sorrow of Holy Ghost conviction of sin. (II Corinthians 7:10; Psalms 51; Acts 11:18; II Timothy 2:25; Genesis 6:3; Romans 1:18-32; Matthew 9:12-13).

<h3>Section XXXII.</h3>
We believe that the Scriptures are clear concerning helping those in need. We are commanded to do good to all people as we have opportunity, with a special emphasis upon caring for those who profess to be fellow Christians, especially those of our own fellowship of believers. We are commanded to be generous and willing to share, laying up treasure for ourselves in the coming age by our kindness and generosity in this life. This is true for the church as an organization as well as for the individual members of the church. Therefore, in accordance with the biblical commands, as a fundamental aspect of the practice of our faith, we will share of our material goods with those in need and will minister to them to the best of our abilities, whatever the need. (Proverbs 25:21; Isaiah 58:10; Galatians 6:10; I Timothy 6:18-19; Hebrews 13:16).

<h3>Section XXXIII.</h3>
The Church, by its very composition, is a membership organization. The local church is the manifestation within our society of the church. Each local church exists for an express purpose in God's plan. Individual members of the Body of Christ will wish to associate with our congregation as members. All believers are members of the church. The Lord will set some of those members of the church into this local congregation as members as it pleases Him. As members of this local congregation they are given into the care and oversight of the leadership, which must give an account to God for theirs souls. The pastor of this church shall have the right to determine who may attend church meetings and functions. This church is owned by the Lord Jesus Christ who has entrusted the care of the flock (congregation) to the leadership He has raised up here. It is not a place of public accommodation, nor is it a public institution, and its property is not a public place but is rather, private property belonging to this church. (Acts 20: 28-31; II Peter 2:1-3; I Timothy 1:20; 6:5; I Corinthians 5:1-13; II Thessalonians 3:6-15; II John 9:11; II Timothy 3:1-5; Titus 3:10-11; Romans 16:17).

<h3>Section XXXIV.</h3>
We believe that the scriptures clearly define that members of a congregation can seek out advice, consultation, direction, purpose, resolution, and guidance from the pastor, mature men and women approved and appointed by the pastor and the Five-fold Ministry Gifts within the Body of Christ. (I Kings 1:12; Proverbs 27:9; Proverbs 11:14; Psalms 55:13-14). We further believe that consultation and instruction is applicable by the scriptures through sessions, a company of persons in close deliberation set together, to lay a foundation, set in place and give wise counsel. This also provides safety, defense, rescue and freedom from trouble. (Psalms 55:13-14; Proverbs 1:11-14; Proverbs 12:15) The personal care of the saints is the sanctification of the whole person, spirit, soul and body. (I Thessalonians 3:13; 5:23). Through the love that flows from faith, patience and hope, and the redemptive power of the Cross of Christ, (Romans 3:25; Luke 9:23), the atoning Blood of Jesus, (Ephesians 2:13-16; I Peter 1:18-19), the transformation of the soul through the Word of God, (Romans 12:1-2) the denying of the old nature, (Galatians 2:20; 5:24; I Peter 1:13-15) salvation through grace not of works, (Ephesians 2:1-8 and the promise of the resurrection, (John 3:16; 10:25-26) are the effective working mechanisms that characterize pastoral care ministry. Such ministry is foundational to the practice of our faith.

<h3>Section XXXV.</h3>
We recognize and believe that the church, in these last days, has been and is in a revival of restoration because much truth was lost from the Church during the medieval times (also known as the Dark Ages). We maintain that God, in this hour is moving to restore the church to the complete and full New Testament pattern power and practice, but shall not be limited to just this. We therefore shall examine all new doctrinal concepts in the light of the full revealed Word of God, and if they shall be found to be in harmony with the scriptures they shall be accepted, taught and practiced. We believe that a complete revelation and truth of God is already written and contained in the scripture and that its progressive unfolding will only as to and not take from what God has already restored to the church. (Acts 3:21; 15:15; II Peter 1:20; Ephesians 3:1-6; Revelation 10:6-7).
	"
}